# coding:utf-8
import time
import tkinter as tk
from tkinter import Label
import random
import tkinter.messagebox

#第一套选择题
choice_1=[{'题目': '出租汽车驾驶员从业资格全国公共科目考试成绩在()内有效。', 'A': 'A.省、直辖市域范围', 'B': 'B.市域范围', 'C': 'C.全国范围', 'D': 'D.县市域范围', 'T': 'C'}, {'题目': '出租汽车驾驶员从业资格全国公共科目考试实行()的考试大纲。', 'A': 'A.全国统', 'B': 'B.全省统', 'C': 'C.地市统', 'D': 'D.县内统', 'T': 'A'}, {'题目': '出租汽车驾驶员取得从业资格后,并进行(),方可从事出租汽车客运服务。', 'A': 'A.培训', 'B': 'B.实习', 'C': 'C.注册', 'D': 'D.继续教育', 'T': 'C'}, {'题目': '拟从事出租汽车客运服务的驾驶员,应当向()申请参加出租汽车驾驶员从业资格考试。', 'A': 'A.从业资格培训机构', 'B': 'B设区的市级地方人民政府出租汽车行政主管部门', 'C': 'C.出租汽车行业协会', 'D': 'D大型出租汽车经营企业', 'T': 'B'}, {'题目': '出租汽车驾驶员到从业资格证发证机关核定的范围外从事出租汽车客运服务的,应当()。', 'A': 'A.参加当地的从业资格换证考试', 'B': 'B.参加全国公共科目考试', 'C': 'C.参加当地的区域科目考试', 'D': 'D.重新参加全国公共科目考试和当地的区域科目考试', 'T': 'C'}, {'题目': '受理注册申请的出租汽车行政主管部门应当在()内办理完结注册手续。', 'A': 'A.3日', 'B': 'B.5日', 'C': 'C.10日', 'D': 'D.15日', 'T': 'B'}, {'题目': '巡游出租汽车驾驶员注册有效期届满需继续从事出租汽车客运服务的,应当在有效期届满30日前,向所在地()申请延续注册。', 'A': 'A.网信部门', 'B': 'B.公安交管部门', 'C': 'C.出租汽车行政主管部门', 'D': 'D.工商管理部门', 'T': 'C'}, {'题目': '出租汽车驾驶员从业资格注册有效期为()。', 'A': 'A.1年', 'B': 'B.2年', 'C': 'C.3年', 'D': 'D.5年', 'T': 'C'}, {'题目': '申请从业资格注册或者延续注册的出租汽车驾驶员,应当到()申注册。', 'A': 'A.发证机关所在地的出租车行政主管部门', 'B': 'B.发证机关所在地的县级交通运输主管部门', 'C': 'C.发证机关所在地的市级交通运输主管部门', 'D': 'D.发证机关所在地的省级交通运输主管部门', 'T': 'A'}, {'题目': '个体巡游出租车经营者自己驾驶出租汽气车从事经营活动的,持其()申请注册。', 'A': 'A.身份证、机动车驾驶证', 'B': 'B.从业资格证、车辆运营证', 'C': 'C.机动车驾驶证、从业资格证', 'D': 'D.机动车驾驶证、车辆运营证', 'T': 'B'}, {'题目': '出租汽车驾驶员注册有效期届满需继续从事出租汽车客运服务的,应当在有效期届满前()内申请延续注册。', 'A': 'A.5日', 'B': 'B.10日', 'C': 'C.20日', 'D': 'D.30日', 'T': 'D'}, {'题目': '巡游出租汽车驾驶员在从业资格注册有效期内,与出租汽车经营者解除劳动合同或者经营合同的,应当在()内向原注册机构报告,并电请注销注册。', 'A': 'A.5日', 'B': 'B.10日', 'C': 'C.20日', 'D': 'D.30日', 'T': 'C'}, {'题目': '出租汽车驾驶员取得从业资格证超过3年未申请注册的,注册后上岗前应当完成不少于()学时的继续教育。', 'A': 'A.72', 'B': 'B.54', 'C': 'C.27', 'D': 'D.18', 'T': 'C'}, {'题目': '出租汽车驾驶员继续教育由()组织实施', 'A': 'A.自学', 'B': 'B.出租汽车经营者', 'C': 'C.驾驶员培训学校', 'D': 'D.继续教育机构', 'T': 'B'}, {'题目': '出租汽车驾驶员最近连续()个记分周期内记满12分记录。由发证机关撤销其从业资格证,并公告作废。', 'A': 'A.1', 'B': 'B.2', 'C': 'C.3', 'D': 'D.4', 'T': 'C'}, {'题目': '出租汽车驾驶员从业资格证遗失、毁损的,应当到原发证机关办理()手续。', 'A': 'A..注销证件', 'B': 'B.撤销证件', 'C': 'C.证件补(换)发', 'D': 'D.从业资格补考', 'T': 'C'}, {'题目': '出租汽车驾驶员因身体健康等其他原因不宜继续从事出租汽车客运服务的,由发证机关()其从业资格证。', 'A': 'A.注销', 'B': 'B.撤销', 'C': 'C.补(换)发', 'D': 'D.核发', 'T': 'A'}, {'题目': '出租汽车驾驶员达到法定退休年龄的,由发证机关()其从业资格证。', 'A': 'A.注销', 'B': 'B.撒销', 'C': 'C.补(换)发', 'D': 'D.审核延续', 'T': 'A'}, {'题目': '出租汽车驾驶员身体健康状况不再符合有关机动车驾驶员和相关从业要求且没有主动申请注销从业资格的,由发证机关()其从业资格证。', 'A': 'A.注销', 'B': 'B.撤销', 'C': 'C.补(换)发', 'D': 'D.强制追回', 'T': 'B'}, {'题目': '出租汽车驾驶员有交通肇事犯罪、危险驾驶犯罪记录,有吸毒记录,有饮酒后驾驶记录,有暴力犯罪记录,最近连续3个记分周期内记满12分记录的,由发证机关()其从业资格证。', 'A': 'A.注销', 'B': 'B.撤销', 'C': 'C.补(换)发', 'D': 'D.强制追回', 'T': 'B'}, {'题目': '出租汽车行政主管部门应当将出租汽车驾驶员违法行为记录等作为()的依据。', 'A': 'A.出租汽车企业经营权延续经营', 'B': 'B.服务质量信誉考核', 'C': 'C.出租汽车企业经营权招投标', 'D': 'D.出租汽车企业处罚标准', 'T': 'B'}, {'题目': '出租汽车驾驶员有拒载、议价等违法行为的,应当加强继续教育:情节严重的,出租汽车行政主管部门应当对其()。', 'A': 'A.延期注册', 'B': 'B.注销从业资格证', 'C': 'C.撤销从业资格证', 'D': 'D.吊销从业资格证', 'T': 'A'}, {'题目': '网约车行驶里程达到（ ）万千米时强制报废。', 'A': 'A.50', 'B': 'B.60', 'C': 'C.70', 'D': 'D.80', 'T': 'B'}, {'题目': '行驶里程未达到60万千米但使用年限达到()的网约车,应当退出经营。', 'A': 'A.5年', 'B': 'B.6年', 'C': 'C.7年', 'D': 'D.8年', 'T': 'D'}, {'题目': '网约车驾驶员不再具备从业条件或者有严重违法行为的,由县级以上出租汽车行政主管部门依据相关法律法规的有关规定()从业资格证件。', 'A': 'A..撤销或者吊销', 'B': 'B.暂扣', 'C': 'C.重新核发', 'D': 'D.注销', 'T': 'A'}, {'题目': '网约车驾驶员的行政处罚信息将被计入()信用记录。', 'A': 'A.驾驶员和网约车平台公司', 'B': 'B.工商部门', 'C': 'C.公安机关', 'D': 'D.价格管理部门', 'T': 'A'}, {'题目': '网约车平台公司所采集的个人信息和生成的业务数据,保存期限不少于()。', 'A': 'A.1年', 'B': 'B.2年', 'C': 'C.3年', 'D': 'D.4年', 'T': 'B'}, {'题目': '出租车驾驶员违规收费的,由()进行处罚', 'A': 'A.出租车行政主管部门', 'B': 'B.价格主管部门', 'C': 'C.工商部门', 'D': 'D.公安机关', 'T': 'A'}, {'题目': '网约车平台公司暂停或者终止运营的,应当提前()向服务所在地出租汽车行政主管部门书面报告,说明有关情况,通告提供服务的车辆所有人和驾驶员,并向社会公告。', 'A': 'A.10日', 'B': 'B.20日', 'C': 'C.30日', 'D': 'D.60日', 'T': 'C'}, {'题目': '网约车平台公司应当按照有关规定,与驾驶员签订多种形式的(),明确双方的权利和义务。', 'A': 'A.劳动合同或者经营合同', 'B': 'B.劳动合同或者协议', 'C': 'C.劳动合同', 'D': 'D.经营合同', 'T': 'B'}, {'题目': '网约车平台公司应当保证线上提供服务的驾驶员与线下实际提供服务的驾驶员一致,并将驾驶员相关信息向()报备。', 'A': 'A.服务所在地出租汽车行政主管部门', 'B': 'B.服务所在地出租汽车行业协会', 'C': 'C.服务所在地工商行政管理部门', 'D': 'D.服务所在地网信管理部门', 'T': 'A'}, {'题目': '网约车平台公司所采集的个人信息和生成的业务数据应当在()存储和使用。', 'A': 'A.中国大陆', 'B': 'B.中国境内', 'C': 'C.中国本土', 'D': 'D.中国内地', 'T': 'D'}, {'题目': '《巡游出租汽车经营服务管理规定》是为规范出租汽车经营服务行为,保障()的法权益。', 'A': 'A.乘客、驾驶员和巡游出租汽车经管者', 'B': 'B.驾驶员、乘客、巡游出租汽车经营者和管理部门', 'C': 'C.驾驶员、巡游出租汽车经营者和管理部门', 'D': 'D.驾驶员、乘客和管理部门', 'T': 'A'}, {'题目': '巡游出租汽车经营者应当保障出租汽车驾驶员合法权益,依法与其签订()', 'A': 'A.劳动合同或者聘用合同', 'B': 'B.劳动合同或者经营合同', 'C': 'C.劳动合', 'D': 'D.经营合同', 'T': 'B'}, {'题目': '巡游出租汽车经营服务是指(),喷涂、安装出租汽车标识,以()及以下乘用车和驾驶劳务为乘客出行服务,并按照乘客意愿行驶,根据行驶里程和时间计费的经营活动。', 'A': 'A.可在道路上巡游揽客、站点侯客;七座', 'B': 'B.通过预约方式承揽乘客;七座', 'C': 'C.可在道路上巡游揽客;九座', 'D': 'D.通过预约方式承揽乘客;九座', 'T': 'A'}, {'题目': '预约出租汽车经营服务是指以符合条件的()及以下乘用车(),并按照乘客意愿行驶,根据行驶里程、时间或者约定计费的经营活动。', 'A': 'A.七座;可在道路上巡游揽客', 'B': 'B.七座;通过预约方式承揽乘客', 'C': 'C.九座;可在道路上巡游揽客', 'D': 'D.九座;通过预约方式承揽乘客', 'T': 'B'}, {'题目': '国家鼓励通过()方式配置巡游出租汽车的车辆经营权。', 'A': 'A.拍卖', 'B': 'B.服务质量招投标', 'C': 'C.服务质量信誉考核', 'D': 'D.行政审批', 'T': 'B'}, {'题目': '出租汽车驾驶员应当在(),持本人的从业资格证件到当地道路运输管理机构签注服务质量信誉考核等级。', 'A': 'A.每年2月1日', 'B': 'B.每年3月1日前', 'C': 'C.服务质量:信誉考核周期届满后30日内', 'D': 'D.服务质量信誉考核周期届满后60日内', 'T': 'C'}, {'题目': '巡游出租汽车经营者应当根据()等因素及时调整承包费标准或者定额任务等。', 'A': 'A.当地GDP总量', 'B': 'B.经营成本、运力规模', 'C': 'C.经营成本、运价变化', 'D': 'D.驾驶员从业年限', 'T': 'C'}, {'题目': '巡游出租汽车驾驶员有私自转包经营等违法行为的,()应当予以纠正。', 'A': 'A.出租汽车经营者', 'B': 'B.出租汽车行政主管部门', 'C': 'C.工商部门', 'D': 'D.公安机关', 'T': 'A'}, {'题目': '乘客要求驶往偏远地区的,巡游车驾驶员认为必要时,可以要求乘客随同到就近的（）办理验证登记手续,乘客不予配合的,驾驶员有权拒绝提供服务。', 'A': 'A.出租汽车行政管理部门', 'B': 'B.公安机关治安部门', 'C': 'C.经营企业', 'D': 'D.道路运输管理机构', 'T': 'B'}, {'题目': '《出租汽车服务质量信誉考核办法》是为了规范出租汽车驾驶员的服务行为,建立完善出租汽车驾驶员(),提升出租汽车服务水平。', 'A': 'A.诚信体系', 'B': 'B.运营体制', 'C': 'C.准入机制', 'D': 'D.职业保障', 'T': 'A'}, {'题目': '出租汽车驾驶员服务质量信誉考核内容包括遵守法规、（）、经营行为、运营服务等四方面内容。', 'A': 'A.维护稳定', 'B': 'B.安全生产', 'C': 'C.服务质量', 'D': 'D.车容车貌', 'T': 'B'}, {'题目': '出租汽车驾驶员服务质量信誉考核实行基准分值为()分的计分制,另外加分分值为()分。', 'A': 'A.10,10', 'B': 'B.10,20', 'C': 'C.20,10', 'D': 'D.20,20', 'T': 'C'}, {'题目': '出租汽车驾驶员一个考核周期届满,经签注服务质量信誉考核等级后,该考核周期内的（ ）', 'A': 'A.扣分与加分予以保留', 'B': 'B.扣分与加分予以清除', 'C': 'C.扣分予以清除', 'D': 'D.加分予以清除', 'T': 'B'}, {'题目': '网约车平台公司及网约车驾驶员违法使用约车人、乘客个人信息的,由公安、网信等部门依照各自职责处以()的罚款。', 'A': 'A.500元以上1000元以下', 'B': 'B.1000元以上5000元以下', 'C': 'C.3000元以上1万元以下', 'D': 'D.1万元以上3万元以下', 'T': 'C'}, {'题目': '网约车平台公司及网约车驾驶员违法泄露约车人、乘客个人信息的,由公安、网信等部门依照各自职责处以()的罚款。', 'A': 'A.500元以上1000元以下', 'B': 'B.1000元以上5000元以下', 'C': 'C.2000元以上1万元以下', 'D': 'D.1万元以上3万元以下', 'T': 'C'}, {'题目': '使用失效、伪造、变造的从业资格证,驾驶出租汽车从事出租汽车经营活动的,由县级以上出租汽车行政主管部门责令改正,并处()的罚款。', 'A': 'A.500元以上1000元以下', 'B': 'B.1000元以上5000元以下', 'C': 'C.500元以上1万元以下', 'D': 'D.1万元以上3万元以下', 'T': 'D'}, {'题目': '转借、出租、涂改从业资格证的,由县级以上出租汽车行政主管部门责令改正,并处（ ）的罚款。', 'A': 'A.500元以上1000元以下', 'B': 'B.1000元以上5000元以下', 'C': 'C.5000元以上1万元以下', 'D': 'D.1万元以上3万元以下', 'T': 'D'}, {'题目': '驾驶员未取得从业资格证,驾驶出租汽车从事经营活动的,由县级以上出租汽车行政主管部门责令改正,并处()的罚款。', 'A': 'A.500元以上1000元以下', 'B': 'B.1000元以上5000元以下', 'C': 'C.5000元以上1万元以下', 'D': 'D.1万元以上3万元以下', 'T': 'D'}, {'题目': '起讫点均不在许可的经营区域从事巡游出租汽车经营活动的,由县级以上地方人民政府出租汽车行政主管部门责令改正,并处以()罚款。', 'A': 'A.50元以上200元以下', 'B': 'B.500元以上2000元以下', 'C': 'C.5000元以上20000元以下', 'D': 'D.10000元以上20000元以下', 'T': 'C'}, {'题目': '出租汽车驾驶员未办理注册手续驾驶出租汽车从事经营活动的,由县级以上出租汽车行政主管部门责令改正,并处()的罚款。', 'A': 'A.1000元以上3000元以下', 'B': 'B.200元以上2000元以下', 'C': 'C.50元以上200元以下', 'D': 'D.3000元以上1万元以下', 'T': 'B'}, {'题目': '巡游出租汽车驾驶员转让、倒卖、伪造巡游出租汽车相关票据的,由县级以上地方人民政府出租汽车行政主管部门责令改正,并处以（ ）罚款。', 'A': 'A.50元以上200元以下', 'B': 'B.500元以上2000元以下', 'C': 'C.5000元以上20000元以下', 'D': 'D.10000元以上20000元以下', 'T': 'B'}, {'题目': '下列哪项做法符合《出租汽车运营服务规范》(GB/22485-2013)的要求?', 'A': 'A按乘客意愿选择合理路线', 'B': 'B需改变行驶路线时可以不征求乘客意见', 'C': 'C.使用音响和空调是驾驶员的权利', 'D': 'D乘客的遗留物品,驾驶员可自行处理', 'T': 'A'}, {'题目': '出租汽车驾驶员有权拒载()。', 'A': 'A醉酒后丧失自控能力但有人陪同的人员', 'B': 'B.携带易燃、易爆、有毒有害等危险品的人员', 'C': 'C.残障人士', 'D': 'D.孕妇', 'T': 'B'}, {'题目': '下列那种情形视为拒载?', 'A': 'A.乘客携带易燃、易爆等危险物品时,出租汽车驾驶员不予载客的', 'B': 'B问乘乘客去向后,出租汽车驾驶员以不熟悉通行路线为由不予载客的', 'C': 'C醉酒或者精神病患者乘车无陪同人员,出租汽车驾驶员不予载客的', 'D': 'D乘客夜间去偏远地区而不按规定办理登记或相关手续,出租汽车驾驶员不予载客的', 'T': 'B'}, {'题目': '乘客乘坐出租汽车时,从车内往车窗外扔东西,驾驶员应当（）。', 'A': 'A.礼貌劝阻', 'B': 'B.默许', 'C': 'C.批评教育', 'D': 'D.及时停车捡回', 'T': 'A'}, {'题目': '乘客乘车时若将头、手臂等伸出车外,出租汽车驾驶员应当（）。', 'A': 'A.默许', 'B': 'B.批评教育', 'C': 'C.礼貌劝阻', 'D': 'D.指责乘客', 'T': 'C'}, {'题目': '当乘客上、下车时,出租汽车驾驶员的下列行为中正确的是（）。', 'A': 'A.在道路内侧强行并线靠边停车', 'B': 'B.在道路中央即停即走', 'C': 'C.在允许停车路段靠右临时停车', 'D': 'D.在交叉路口即停即走', 'T': 'C'}, {'题目': '出租汽车驾驶员在城市道路运营过程中,车辆突然发生故障,不能继续载客时,应当（）。', 'A': 'A.协助乘客换乘,免收或减收车费', 'B': 'B.按起步价收取车费', 'C': 'C.按计程计价设备显示金额收费', 'D': 'D.请乘客在车内等候,等待救援维修', 'T': 'A'}, {'题目': '搭载乘客在单行道行驶时,乘客要求掉头改变行车路线,出租汽车驾驶员应当()。', 'A': 'A.满足乘客要求', 'B': 'B.不予理睬乘客要求', 'C': 'C.让乘客下车换乘其他车辆', 'D': 'D.向乘客解释清楚后改行合理路线', 'T': 'D'}, {'题目': '乘客到达目的地后,出租汽车驾驶员下列哪种做法是错误的?', 'A': 'A.提醒乘客带好随身物品', 'B': 'B.在确保安全的情况下,可在禁停路段让乘客下车', 'C': 'C.按计程计价设备显示金额收费', 'D': 'D.向乘客交付出租汽车发票', 'T': 'B'}, {'题目': '出租汽车驾驶员在载客运营过程中,应当根据()使用空调。', 'A': 'A.经营者要求', 'B': 'B.管理部门要求', 'C': 'C.乘客需求', 'D': 'D.自己需求', 'T': 'C'}, {'题目': '驾驶巡游出租汽车行至禁停路段时应()。', 'A': 'A.在车流较少时可上、下乘客', 'B': 'B.无人看管时可上、下乘客', 'C': 'C.按乘客需要停车', 'D': 'D.按规定在站点即停即走', 'T': 'D'}, {'题目': '客流高峰时期,巡游出租汽车在空车待租状态下遇有多名乘客扬手招车时,驾驶员应当（）。', 'A': 'A.选择距离本车行进方向最近的乘客', 'B': 'B.根据目的地远近选择乘客', 'C': 'C.根据乘客目的地道路拥堵状况选择乘客', 'D': 'D.根据小费多少选择乘客', 'T': 'A'}, {'题目': '乘客携带行李乘坐出租汽车时,驾驶员应当（）。', 'A': 'A.帮助乘客放置行李', 'B': 'B.让乘客自已放置行李', 'C': 'C.让站点管理人员放置行李', 'D': 'D.额外收取行李运送费', 'T': 'A'}, {'题目': '出租汽车驾驶员在载客运营过程中,正确使用车内音响设备的做法是()。', 'A': 'A.按运营需求听取交通广播', 'B': 'B.按乘客要求使用', 'C': 'C.尽量不使用', 'D': 'D.按自己兴趣收听节目', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中行驶路线和乘客发生分歧时,在不违反有关法律法规的前提下,驾驶员应该()。', 'A': 'A.让乘客下车', 'B': 'B.按乘客意见行驶', 'C': 'C.按自己意见行驶', 'D': 'D.向出租汽车企业求助', 'T': 'B'}, {'题目': '运营过程中遇交通堵塞、道路临时封闭等确需改变行驶路线时,出租汽车驾驶员应当()。', 'A': 'A.向乘客提前解释', 'B': 'B.直接绕行', 'C': 'C.免收绕行距离的费用', 'D': 'D.到目的地后再解释', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营过程中遇到乘客不适,下列做法不正确的是（）。', 'A': 'A.尽量平稳驾驶', 'B': 'B.拨打求助电话', 'C': 'C.就近送达医院', 'D': 'D.让乘客下车', 'T': 'D'}, {'题目': '出租汽车驾驶员在运营过程中,如乘客改变目的地,驾驶员（）。', 'A': 'A.可让乘客下车', 'B': 'B.应按新目的地重新选择合理路线', 'C': 'C.可加收车费', 'D': 'D.将乘客直接送达原目的地', 'T': 'B'}, {'题目': '出租汽车驾驶员运送乘客途中,如乘客因故需要短暂离开出租汽车,要求驾驶员停车等候,驾驶员应()。', 'A': 'A.拒绝', 'B': 'B.尽量配合', 'C': 'C.跟踪乘客', 'D': 'D.收取小费', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中遇醉酒乘客,无法明确目的地时应该()。', 'A': 'A.尽可能帮助查询或拨打公安部门求助电话', 'B': 'B.强行将其拖下车', 'C': 'C.咨询出租汽车行政主管部门', 'D': 'D.将其送至出租汽车企业', 'T': 'A'}, {'题目': '出租汽车驾驶员在乘客下车时,应向乘客()。', 'A': 'A.提出对本次服务评价为优', 'B': 'B.提醒拿好随身物品', 'C': 'C.索要小费', 'D': 'D.索取联系方式', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营途中()不能完成载客服务,视为拒载或甩客。', 'A': 'A.遇道路、气候特殊情况', 'B': 'B.临时处理私事', 'C': 'C.发生交通事故', 'D': 'D.出现车辆故障', 'T': 'B'}, {'题目': '巡游出租汽车服务标志不包括()。', 'A': 'A.车身广告', 'B': 'B.空车待租标志', 'C': 'C.电召服务标志', 'D': 'D.暂停运营标志', 'T': 'A'}, {'题目': '出租汽车应按规定进行定期检验属于（）。', 'A': 'A.车容车貌要求', 'B': 'B.车辆基本要求', 'C': 'C.服务标志要求', 'D': 'D.专用设施要求', 'T': 'B'}, {'题目': '出租汽车车身内外清洁完好,漆皮完整无损,()个性化装饰。', 'A': 'A.不做', 'B': 'B.按行业管理规定做', 'C': 'C.按个人意愿做', 'D': 'D.按企业要求做', 'T': 'A'}, {'题目': '出租汽车行李箱内可供乘客放置行李物品的空间应不小于行李箱的()。', 'A': 'A.三分之一', 'B': 'B.二分之一', 'C': 'C.三分之二', 'D': 'D四分之三', 'T': 'C'}, {'题目': '巡游出租汽车车身颜色的样式必须()喷涂。', 'A': 'A.按自己意愿', 'B': 'B.按出租汽车行政主管都门的要求', 'C': 'C.按企业要求', 'D': 'D..按市民要求', 'T': 'B'}, {'题目': '巡游出租汽车经营者应按照(),在车内适当的位置设置服务质量监督卡、价格标准、乘客须知等信息。', 'A': 'A.自己意愿', 'B': 'B.行业管理规定', 'C': 'C.所在企业要求', 'D': 'D.乘客要求', 'T': 'B'}, {'题目': '巡游出租汽车应按()的要求,在车顶安装出租汽车标志顶灯与空车待租标志联动,夜间应有照明。', 'A': 'A.出租汽车行政主管部门', 'B': 'B.维修企业', 'C': 'C.所在企业', 'D': 'D.城市居民', 'T': 'A'}, {'题目': '上路运营的出租汽车必须设置()。', 'A': 'A.广告标志', 'B': 'B.真皮座套', 'C': 'C.倒车雷达', 'D': 'D.车辆卫星定位装置', 'T': 'D'}, {'题目': '整洁、卫生,无杂物、异味是对出租汽车()的要求。', 'A': 'A.消防设施', 'B': 'B.服务标志', 'C': 'C.专用设施', 'D': 'D.车辆整洁卫生', 'T': 'D'}, {'题目': '在车厢内外适当位置明示出租汽车经营者名称或简称、价格标准、服务监督电话和乘客须知信息等是对巡游出租汽车()的要求。', 'A': 'A.车容车貌', 'B': 'B.服务标志', 'C': 'C.车辆基本性能', 'D': 'D.专用设施', 'T': 'B'}, {'题目': '下列哪项不属于出租汽车必须安装或配置的设施?', 'A': 'A.计程计价设备', 'B': 'B.车身电子稳定系统', 'C': 'C.消防器材', 'D': 'D.车载卫星定位系统', 'T': 'B'}, {'题目': '下列哪项不属于对出租汽车号牌的要求?', 'A': 'A.字迹清晰', 'B': 'B.固定端正', 'C': 'C.无遮挡物、反光物', 'D': 'D.定期更新', 'T': 'D'}, {'题目': '车身内外清洁完好,不做个性化装饰,漆皮、外饰条完好无损是对出租汽车()的要求。', 'A': 'A.专用设施', 'B': 'B.服务标志', 'C': 'C.车容车貌', 'D': 'D.消防设施', 'T': 'C'}, {'题目': '下列哪项不属于对巡游出租汽车计程计价设备的要求?', 'A': 'A.安装位置符合规定', 'B': 'B.数字显示清晰', 'C': 'C.发票打印准确、清晰', 'D': 'D.定期自行校准', 'T': 'D'}, {'题目': '出租汽车车容车貌既反映出租汽车服务质量,也反映城市的（ ）。', 'A': 'A.包容程度', 'B': 'B.文明程度', 'C': 'C.发展速度', 'D': 'D.文化底蕴', 'T': 'B'}, {'题目': '小王的出租汽车在接受检查时,被要求取下息挂在后视镜上的一串风铃,这样做的原因是()。', 'A': 'A.容易让乘客产生误解,引发投诉', 'B': 'B.不符合当地的风俗习惯', 'C': 'C.制作不精美,影响了车的美观程度', 'D': 'D.不得违规在车内悬挂影响行车安全的设施设备', 'T': 'D'}, {'题目': '出租汽车驾驶员在运营中按规定要求携带的证件不包括()。', 'A': 'A.继续教育合格证', 'B': 'B.从业资格证', 'C': 'C.道路运输证或网络预约出租汽车运输证', 'D': 'D.机动车驾驶证', 'T': 'A'}, {'题目': '下列哪项不属于在巡游出租车车厢内外显著位置明示的信息?', 'A': 'A.价格标准', 'B': 'B.当地特色景点', 'C': 'C.出租汽车经营者名称或者简称', 'D': 'D服务监督电话', 'T': 'B'}, {'题目': '无障碍出租车应保证有充足的空间安放（）。', 'A': 'A.车载电话', 'B': 'B.视频播放设备', 'C': 'C.轮椅', 'D': 'D.车载冰箱', 'T': 'C'}, {'题目': '下列哪项不是网络预约出租汽车车辆的必备条件?', 'A': 'A.安装应急报警装置', 'B': 'B.发动机应带有涡轮测压装置', 'C': 'C.车辆轴距、排量、车龄符合所在地方政府管理部门的规定', 'D': 'D.车内不应悬挂或放置影响行车安全的设施', 'T': 'B'}, {'题目': '下列哪项做法不符合出租汽车驾驶员服务仪容要求？', 'A': 'A.在运营过程中举止文明,礼貌待客', 'B': 'B.除工作装外,可以按照个人喜好着装上岗', 'C': 'C.运营前忌食有异味、有碍服务的食物', 'D': 'D.手、脚保持洁净,指甲修剪得体', 'T': 'B'}, {'题目': '出租汽车驾驶员按规定着装、佩戴胸卡或服务标志,衣着整洁、服饰大方,发式整齐、面目洁净,是驾驶员()的要求。', 'A': 'A.个性修饰', 'B': 'B.形象文明', 'C': 'C.安全行车', 'D': 'D言行文明', 'T': 'B'}, {'题目': '出租汽车驾驶员服务仪容要求不包括()。', 'A': 'A.身体无异味', 'B': 'B.正确佩戴服务标志', 'C': 'C.穿着时尚、高档', 'D': 'D.衣着得体', 'T': 'C'}, {'题目': '乘客间相互交谈过程中,驾驶员应当()。', 'A': 'A.随意插话', 'B': 'B.要求乘客保持安静', 'C': 'C.打断乘客说话', 'D': 'D.专心开车,不插话', 'T': 'D'}, {'题目': '乘客招手,驾驶员准备停车的时候,有另外一辆出租汽车抢在其前面招呼乘客上车,驾驶员应该()。', 'A': 'A.要求抢客车辆的驾驶员赔偿损失', 'B': 'B.尊重乘客乘车选择', 'C': 'C.要求乘客乘自己的车', 'D': 'D.与抢客车辆驾驶员据理力争', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中根据乘客需求使用普通话、地方方言、外语,属于（）要求。', 'A': 'A.服务标志', 'B': 'B.服务仪容', 'C': 'C.车容车貌', 'D': 'D.服务用语和言行举止', 'T': 'D'}, {'题目': '出租汽车驾驶员在行车中应该做到（）。', 'A': 'A.不吸烟、不接打电话', 'B': 'B.无人监管时将垃圾抛出车外,保持车内整洁', 'C': 'C.根据个人意愿收听广播节目', 'D': 'D.摇下下车窗玻璃后吸烟', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营过程中对乘客的提问应()。', 'A': 'A.根据自己的心情好坏回答', 'B': 'B.及时回答,不必顾及内容真实性', 'C': 'C.对自已不清楚的问题不予理会', 'D': 'D.主动、耐心、如实回答或解释', 'T': 'D'}, {'题目': '出租汽车驾驶员在运营过程中,对乘客的批评意见应（）。', 'A': 'A.不予理睬', 'B': 'B.虚心接受', 'C': 'C.强硬回绝', 'D': 'D.据理力争', 'T': 'B'}, {'题目': '下列不符合出租汽车驾驶员服务用语要求的是()。', 'A': 'A.提倡使用普通话', 'B': 'B.根据乘客需要使用地方方言', 'C': 'C.提倡掌握外语接待外国乘客', 'D': 'D.无论乘客是否能听懂,使用常说的本地方言', 'T': 'D'}, {'题目': '不属于出租汽车驾驶员服务用语规范的是()。', 'A': 'A.您需要打开音响吗?', 'B': 'B.你该下车了。', 'C': 'C.请带好您的随身物品。', 'D': 'D.请系好安全带。', 'T': 'B'}, {'题目': '下列哪项是出租汽车驾驶员在乘客上车时使用的文明用语?', 'A': 'A.请提前准备好车费', 'B': 'B.动作快点', 'C': 'C.请快一点', 'D': 'D.你好,请上车', 'T': 'D'}, {'题目': '下列哪项是出租汽车驾驶员在乘客下车时使用的文明用语?', 'A': 'A.请把钱付了', 'B': 'B.请抓紧时间下车', 'C': 'C.欢迎再次乘坐', 'D': 'D.没有零钱了,就不找您了', 'T': 'C'}, {'题目': '《出租汽车运营服务规范》(GBT22485-2013)要求出租汽车驾驶员服务用语应()。', 'A': 'A.规范准确、文明礼貌', 'B': 'B.规范标准、语言简练', 'C': 'C.意思完整、有礼有节', 'D': 'D.口齿伶俐、表情丰富', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营服务时,乘客要求在禁停路段停车时劝阻的服务用语是（）。', 'A': 'A.不能停,否则要罚款。', 'B': 'B.对不起,这里不允许停车', 'C': 'C.您没有看见禁停标志吗?', 'D': 'D.这里怎么能停车啊!', 'T': 'B'}, {'题目': '遇乘客迟迟不上车,驾驶员应当使用的服务用语是()。', 'A': 'A.您需要等候吗?', 'B': 'B.再不上我就走了啊。', 'C': 'C.你还坐不坐车?', 'D': 'D.请您抓紧时间,不要耽误我运营。', 'T': 'A'}, {'题目': '出租汽车驾驶员与乘客交谈时,不属于谈话忌讳的是（）。', 'A': 'A.个人隐私', 'B': 'B.未经核实的小道消息', 'C': 'C.个人负面情绪', 'D': 'D.介绍城市景色', 'T': 'D'}, {'题目': '出租汽车驾驶员在与女性乘客交谈时,不适合询问的是（）。', 'A': 'A.乘客是否需要使用空调', 'B': 'B.乘客是否需要听音乐', 'C': 'C.乘客婚姻状况和年龄', 'D': 'D.乘客兴趣爱好', 'T': 'C'}, {'题目': '对老年男性乘客使用的尊称不包括()。', 'A': 'A.老师傅', 'B': 'B.老头', 'C': 'C.老人家', 'D': 'D.老先生', 'T': 'B'}, {'题目': '遇到儿童乘客乘车,应做好的服务不包括()。', 'A': 'A.提醒儿童注意安全', 'B': 'B.提醒儿童不要乱动车内设备', 'C': 'C.提醒儿童不要将头手伸出窗外', 'D': 'D.提醒儿童车上有好吃的糖果', 'T': 'D'}, {'题目': '符合出租汽车驾驶员做好伤病乘客服务要求的行为是（）。', 'A': 'A.安排伤员躺卧在后排座位上', 'B': 'B.伤员无人陪同又确有需要时,驾驶员不宜主动协助办理救治手续', 'C': 'C.对患病乘客播放摇滚乐以放松心情', 'D': 'D.直接将患病乘客拉到有回扣的医院就医', 'T': 'A'}, {'题目': '遇到盲人乘客乘车,出租汽车驾驶员应该（）。', 'A': 'A.打开车门锁,提醒乘客自行上车', 'B': 'B.打开车门,耐心等候乘客上车', 'C': 'C.加收服务费', 'D': 'D.主动下车,将盲人搀扶至车内', 'T': 'D'}, {'题目': '盲人乘客不能辨认计程计价设备,因此出租汽车驾驶员正确的收费做法是()。', 'A': 'A.加收服务费', 'B': 'B.按计程计价设备金额收取', 'C': 'C.提前议价', 'D': 'D.虚报计价设备显示金额', 'T': 'B'}, {'题目': '遇有()乘客乘坐出租汽车时,应尽可能将其安排到前排就座,以便沟通或指明目的地。', 'A': 'A.盲人', 'B': 'B.聋哑', 'C': 'C..老人', 'D': 'D.小孩', 'T': 'B'}, {'题目': '遇有患病、老弱乘客乘坐出租汽车时,驾驶员应(),关闭车窗,保持安静的乘车环境。', 'A': 'A.加快车速超速行驶', 'B': 'B.关闭车载卫星定位系统', 'C': 'C.关闭计程计价设备', 'D': 'D.关闭音响', 'T': 'D'}, {'题目': '乘客乘坐出租车过程中有呕吐征兆时,驾驶员应当（）。', 'A': 'A.提供备用纸巾及塑料袋,必要时征求乘客意见后及时停车', 'B': 'B.结清车费请乘客下车', 'C': 'C.请乘客打开车窗准备向窗外呕吐', 'D': 'D.提高车速尽快送乘客到目的地', 'T': 'A'}, {'题目': '出租汽车驾驶员应做好伤病乘客的服务,对受伤的乘客,出租汽车驾驶员不得（）。', 'A': 'A.及时联系其亲属', 'B': 'B.协助乘客上车', 'C': 'C.为避免麻烦拒载', 'D': 'D.平稳驾驶', 'T': 'C'}, {'题目': '遇到行走不便的乘客乘坐出租汽车时,驾驶员应该()。', 'A': 'A.征得同意后主动协助乘客上车', 'B': 'B.不予搭载', 'C': 'C.提示乘客尽快上车', 'D': 'D.保持高速行驶,弥补上下车时耽误的时间', 'T': 'A'}, {'题目': '下列哪种行为属于服务禁忌?', 'A': 'A.行车时接打手机', 'B': 'B.路桥通行费由乘客承担', 'C': 'C.得乘客同意后拼客', 'D': 'D.提醒乘客勿将头伸出窗外', 'T': 'A'}, {'题目': '出租汽车驾驶员未经乘客同意不得()。', 'A': 'A.按计程计价设备金额收费', 'B': 'B.使用车载卫星定位系统', 'C': 'D.询问乘客目的地', 'D': 'C.拼客', 'T': 'C'}, {'题目': '出租汽车驾驶员在与乘客交流时应()紧盯乘客。', 'A': 'A.适时', 'B': 'B.避免', 'C': 'C.必须', 'D': 'D.视情', 'T': 'B'}, {'题目': '出租汽车驾驶员在载客运营过程中,无正当理由擅自中断服务的行为是()。', 'A': 'A.拒载', 'B': 'B.宰客', 'C': 'C.倒客', 'D': 'D.甩客', 'T': 'D'}, {'题目': '出租汽车驾驶员在载客运营过程中未经()同意不得另载他人。', 'A': 'A.企业', 'B': 'B.乘客', 'C': 'C.执法人员', 'D': 'D.管理人员', 'T': 'B'}, {'题目': '出租汽车驾驶员在载客运营过程中未按合理路线行驶的行为属于()。', 'A': 'A.甩客', 'B': 'B.倒客', 'C': 'C.故意绕道行驶', 'D': 'D.拒载', 'T': 'C'}, {'题目': '乘客扬手招车后,在乘客上车前驾驶员不得有()行为。', 'A': 'A.向乘客问好', 'B': 'B.都乘客提拿行李', 'C': 'C.询问乘客目的地', 'D': 'D.打开车门', 'T': 'C'}, {'题目': '以下哪项出租汽车服务评价指标不要求达到100%?', 'A': 'A.车容车貌合格率', 'B': 'B.消防器材合格率', 'C': 'C.车辆服务标志设置合格率', 'D': 'D.乘客投诉处理率', 'T': 'A'}, {'题目': '以下哪项网络预约出租汽车服务评价指标不要求达到100%?', 'A': 'A.乘客满意率', 'B': 'B.车辆相符率', 'C': 'C.驾驶员相符率', 'D': 'D.营运车辆保险购买合格率', 'T': 'A'}, {'题目': '对于出现以下哪个方面投诉,网络预约出租汽车经营者可以不用暂停该驾驶员提供服务?', 'A': 'A.不认路', 'B': 'B.骚扰', 'C': 'C.吸毒', 'D': 'D.超速', 'T': 'A'}, {'题目': '出租汽车驾驶员因个人过失遇乘客投诉后,下列做法错误的是()。', 'A': 'A.坚持我行我素', 'B': 'B.正视现实,承认错误', 'C': 'C.认真做好善后', 'D': 'D.接受经营者的批评、教育和处理', 'T': 'A'}, {'题目': '出租汽车驾驶员与乘客发生矛盾或纠纷,下列做法不恰当的是', 'A': 'A.要宽容大庋,以理服人', 'B': 'B.要保持冷静,举止文明', 'C': 'C.要尊重乘客的意见和人格', 'D': 'D.立刻请公安部门依法处理', 'T': 'D'}, {'题目': '出租汽车服务评价指标中,要求驾驶员从业资格证件拥有率达到()。', 'A': 'A.90%及以上', 'B': 'B.95%及以上', 'C': 'C.100%', 'D': 'D.85%及以上', 'T': 'C'}, {'题目': '行车途中,老年乘客因车速过快对出租汽车驾驶员小王提出不满,小王应该如何处理?', 'A': 'A.装作没有听见', 'B': 'B.加速驾驶', 'C': 'C.表示抗议', 'D': 'D.及时表达歉意并降低车速', 'T': 'D'}, {'题目': '网络预约出租汽车服务中,与服务评价无关的原始记录有（）。', 'A': 'A.订单日志', 'B': 'B.网上交易日志', 'C': 'C.行驶轨迹日志', 'D': 'D.在线运营时长', 'T': 'D'}, {'题目': '导致道路交通事故发生的各类因素中,人的因素是安全行车的()。', 'A': 'A.主要因素', 'B': 'B.次要因素', 'C': 'C.客观因素', 'D': 'D.外在因素', 'T': 'A'}, {'题目': '下列哪类性格类型有助于出租汽车驾驶员避免发生道路交通事故?', 'A': 'A.没有监控探头时,侥幸违法驾驶', 'B': 'B.遇紧急情况时头脑冷静、处置果断', 'C': 'C.遇到道路拥堵时,情绪烦躁,长鸣喇叭', 'D': 'D.在高速公路高速行驶时,不容忍其他车辆超车', 'T': 'B'}, {'题目': '驾驶员在突然遇到险情时,易引起()反应。', 'A': 'A.激情', 'B': 'B.应急', 'C': 'C.应激', 'D': 'D.积极', 'T': 'C'}, {'题目': '出租汽车驾驶员在道路宽阔、视线良好、长途行车等情况下,极易产（）。', 'A': 'A.挫折心理', 'B': 'B.攀比心理', 'C': 'C..麻痹心理', 'D': 'D.好胜心理', 'T': 'C'}, {'题目': '下列做法能体现出租汽车驾驶员具有良好心理素质的是（）。', 'A': 'A.因家庭矛盾内心抑郁时,不礼貌待客', 'B': 'B.遇城市道路拥堵时,频繁呜喇叭催促前车', 'C': 'C.与乘客发生服务纠纷时据理力争,盛气凌人', 'D': 'D.心情烦躁或愤怒时,能够迅速调节,尽量做到心平气静', 'T': 'D'}, {'题目': '保证行车安全和服务质量,出租汽车驾驶员在运营过程中应调整情绪,保持()。', 'A': 'A.意志消沉', 'B': 'B.心情舒杨', 'C': 'C.悲观失落', 'D': 'D.无所畏惧', 'T': 'B'}, {'题目': '随着车速的提高,驾驶员的有效视野会()。', 'A': 'A.保持不变', 'B': 'B.越来越宽', 'C': 'C.越来越窄', 'D': 'D.时宽时窄', 'T': 'C'}, {'题目': '出租汽车驾驶员在行车过程中,要正确应对交通冲突,增强()控制能力。', 'A': 'A.环境', 'B': 'B.车流', 'C': 'C.路面', 'D': 'D.情绪', 'T': 'D'}, {'题目': '情绪剧烈波动时,一股情况下驾驶员应激反应能力会（）。', 'A': 'A.下降', 'B': 'B.提高', 'C': 'C.保持不变', 'D': 'D.没有规律', 'T': 'A'}, {'题目': '出租汽车驾驶员心理疏导的目的是为养成坚定、顽强、沉着、果断、机智的品格,不为()左右。', 'A': 'A.金钱', 'B': 'B.事故', 'C': 'C.身体', 'D': 'D.情绪', 'T': 'D'}, {'题目': '如果出租汽车驾驶员不注意观察,就不能把行车中遇到的各种情况迅速传至(),做出正确的反应和判断。', 'A': 'A.耳中', 'B': 'B.中枢神经', 'C': 'C.胸中', 'D': 'D.车内', 'T': 'B'}, {'题目': '下列做法能体现出租汽车驾驶员具有安全、文明行车意识的是（）。', 'A': 'A.出车前检查车辆', 'B': 'B.在高速公路行驶时频繁变更车道', 'C': 'C.雾天行驶时使用远光灯', 'D': 'D.鸣喇叭并高速通过学校门口', 'T': 'A'}, {'题目': '行车中,驾驶员若发现车辆或零部件存在异响、松动等问题时,下列做法错误的是（）。', 'A': 'A.及时停车检查', 'B': 'B.判断故障', 'C': 'C.送维修企业进行修理', 'D': 'D..继续运营', 'T': 'D'}, {'题目': '驾驶员每天出车前要进行“四漏”检査,即车辆有无()现象。', 'A': 'A.漏水、漏油、漏气、漏光', 'B': 'B.漏水、漏油漏光、漏电', 'C': 'C.漏水、漏油漏气、漏电', 'D': 'D.漏水、漏风、漏气、漏电', 'T': 'C'}, {'题目': '驾驶员连续行车4小时,应该停车至少休息()。 ', 'A': 'A.20分钟以上', 'B': 'B.15分钟左右', 'C': 'C..10分钟左右', 'D': 'D.5分钟左右', 'T': 'A'}, {'题目': '预防疲劳驾驶最可靠、最有效的方法是()。', 'A': 'A.收听音乐', 'B': 'B.保证充足睡眠', 'C': 'C.深呼吸', 'D': 'D、喝浓茶', 'T': 'B'}, {'题目': '出租车驾驶员在准备停车下客时,要提前开启右转向灯示意,然后观察路边情况,()', 'A': 'A.并列停放', 'B': 'B.按顺行方向靠右侧停车', 'C': 'C.停在路中', 'D': 'D.随意停车', 'T': 'B'}, {'题目': '驾驶员在行车途中突然遇到路边儿童将皮球滚到路中间,应()。', 'A': 'A.保持原速行驶', 'B': 'B.迅速绕过', 'C': 'C..立即减速,随时准备停车,以防碰撞追逐的儿童', 'D': 'D.从皮球上骑过', 'T': 'C'}, {'题目': '保障乘客安全是对出租汽车服务的基本要求,乘客上车后出租汽车驾驶员应提醒乘客()。', 'A': 'A.不能接打手机', 'B': 'B.不准吃零食', 'C': 'C.系好安全带', 'D': 'D.妥善放置携带的危险品', 'T': 'C'}, {'题目': '驾驶出租汽车途经繁华地带,驾驶员不正确的驾驶方法是（）。', 'A': 'A.注意周围车辆动态', 'B': 'B.保持安全车距', 'C': 'C.防备行人和自行车突然横穿', 'D': 'D.高速平稳通过', 'T': 'D'}, {'题目': '当出租汽车行至公交车站、超市、商场等人车密集场所,要保持低速慢行,随时()。', 'A': 'A.下车指挥', 'B': 'B.加速', 'C': 'C.准备制动', 'D': 'D.抢行', 'T': 'C'}, {'题目': '雾天驾驶出租汽车行驶,不能开启()。', 'A': 'A.近光灯', 'B': 'B.雾灯', 'C': 'C.远光灯', 'D': 'D.示廓灯', 'T': 'C'}, {'题目': '雾天行驶,能见度在5米以内时,应当()。', 'A': 'A.减速行驶', 'B': 'B.集中注意力谨慎驾驶', 'C': 'C.选择安全地点停车', 'D': 'D.以正常速度行驶', 'T': 'C'}, {'题目': '雨天行车时,为避免出现“水滑”现象,驾驶员应该()。', 'A': 'A.低速行驶', 'B': 'B.高速行驶', 'C': 'C.紧急制动', 'D': 'D.频繁变道', 'T': 'A'}, {'题目': '行车遇暴雨,使用刮水器也无法保障正常观察时,此时正确方法是()。', 'A': 'A.集中注意力谨慎驾驶', 'B': 'B.以正常速度行驶', 'C': 'C.减速行驶', 'D': 'D.立即减速靠边停车', 'T': 'D'}, {'题目': '在冰雪路上起步时,猛踩加速踏板会导致()。', 'A': 'A.车辆侧翻', 'B': 'B.驱动轮滑转', 'C': 'C.车辆熄火', 'D': 'D.方向失控', 'T': 'B'}, {'题目': '雪天驾驶出租汽车需要减速时,应()。', 'A': 'A.紧急制动减速', 'B': 'B.利用发动机制动,可轻踩制动踏板', 'C': 'C.猛拉驻车制动器减速', 'D': 'D.挂入“倒挡”', 'T': 'B'}, {'题目': '驾驶出租汽车在冰雪路面行驶的危险性在于()。', 'A': 'A.轮胎附着力增大', 'B': 'B.制动距离延长', 'C': 'C.油电线路容易软化', 'D': 'D.电气设备易受潮短路', 'T': 'B'}, {'题目': '出租汽车在冰雪路面行驶中,驾驶员不能采取的措施是（）。', 'A': 'A.控制车速,避免紧急制动', 'B': 'B.避免急转方向', 'C': 'C.紧跟前车', 'D': 'D.尽量循前车的车辙走', 'T': 'C'}, {'题目': '驾驶出租汽车在冰雪路面应适当()实现安全超车。', 'A': 'A..连续呜喇叭', 'B': 'B.增大横向间距', 'C': 'C.开启前照灯', 'D': 'D.加速尽快超越', 'T': 'B'}, {'题目': '高温天气驾驶出租汽车行驶,发现轮胎温度过高时应（）。', 'A': 'A.给轮胎放气', 'B': 'B.给轮胎浇凉水', 'C': 'C.选择阴凉处停车降温', 'D': 'D.继续行驶', 'T': 'C'}, {'题目': '出租汽车驾驶员在行车中经过积水路面时,要怎样做以保证安全?', 'A': 'A.迅速加速通过', 'B': 'B.保持正常车速通过', 'C': 'C.低挡加速通过', 'D': 'D.低挡低速通过', 'T': 'D'}, {'题目': '部分隧道出口有较强的横风,影响出租汽车驾驶员对车辆的控制,易出现()。', 'A': 'A.车速过快', 'B': 'B.车速过慢', 'C': 'C.熄火现象', 'D': 'D.跑偏现象', 'T': 'D'}, {'题目': '高温天气驾驶出租汽车行驶,发现水温表读数达到100摄氏度时,应()。', 'A': 'A.立即停车并迅速补充冷却液', 'B': 'B.立刻选择安全地点停车降温', 'C': 'C.继续行驶', 'D': 'D.送往维修企业', 'T': 'B'}, {'题目': '驾驶出租汽车高速行驶,突然发现前方道路中间停有故障车辆时,驾驶员应避免()。', 'A': 'A.急转方向', 'B': 'B.制动减速', 'C': 'C.控制方向', 'D': 'D.沉着冷静', 'T': 'A'}, {'题目': '驾驶出租汽车低速行驶,突然发现前方有障碍物时,在道路交通条件允许的前提下驾驶员应该（）。', 'A': 'A.紧急制动', 'B': 'B.转向避让同时减速', 'C': 'C.急转方向', 'D': 'D.及时跳车', 'T': 'B'}, {'题目': '出租汽车通过隧道、涵洞、桥梁时,下列错误的做法是（）。', 'A': 'A.严禁超速、超车', 'B': 'B.及时开启灯光', 'C': 'C.及时变更车道,争取时间', 'D': 'D.不得随意停车', 'T': 'C'}, {'题目': '大风天气行车,由于风向往往不断地发生变化,当感到略有跑偏时,出租汽车驾驶员要()。', 'A': 'A.采取紧急制动', 'B': 'B.双手稳握转向盘', 'C': 'C.顺风向转动转向盘', 'D': 'D.道风向转动转向盘', 'T': 'B'}, {'题目': '高速公路双向行驶的隧道内禁止使用()。', 'A': 'A.近光灯', 'B': 'D.喇叭', 'C': 'B.远光灯', 'D': 'C.示廓灯', 'T': 'B'}, {'题目': '进入隧道时,出租汽车驾驶员应提前开启()。', 'A': 'A.雨刮器', 'B': 'B.左转向灯', 'C': 'C.前照灯、示廓灯', 'D': 'D.右转向灯', 'T': 'C'}, {'题目': '夜间驾驶出租汽车临近会车时,对向车辆仍开启远光灯导致炫目,驾驶员应该()。', 'A': 'A.高速行驶避开眩光', 'B': 'B.保持原速行驶', 'C': 'C.减速或停车让行', 'D': 'D.长鸣喇叭、开启危险报警闪光灯', 'T': 'C'}, {'题目': '驾驶出租汽车在高速公路遇施工路段时,驾驶员应该()。', 'A': 'A.加速通过施工路段', 'B': 'B.到施工现场前紧急制动', 'C': 'C.遵守限速规定提前减速', 'D': 'D.原地掉头', 'T': 'C'}, {'题目': '驾驶出租汽车在高速公路上以低于60公里/小时的车速进入行车道,这种行为()。', 'A': 'A.容易引发追尾碰撞', 'B': 'B.能够保证行车安全', 'C': 'C.容易造成轮胎磨损', 'D': 'D.可以减少燃料消耗', 'T': 'A'}, {'题目': '驾驶岀租汽车从繁忙拥堵的城市道路进λ城乡结合部畅通道路时,驾驶员应该()。', 'A': 'A.紧跟前车行驶', 'B': 'B.控制车速行驶,注意避让非机动车和行人', 'C': 'C.加速行驶,尽快抵达目的地', 'D': 'D.遇到低速车辆频呜喇叭', 'T': 'B'}, {'题目': '出租汽车在高速公路上因故障临时停车时,应在车后多远外放置警告标志?', 'A': 'A.30米', 'B': 'B.50米', 'C': 'C.100米', 'D': 'D.150米', 'T': 'D'}, {'题目': '驾驶出租汽车通过跨海大桥时,要预防的危险因素之一是（）。', 'A': 'A.横风', 'B': 'B.共振', 'C': 'C.水流', 'D': 'D.大气压', 'T': 'A'}, {'题目': '乘客站在道路中拦截行驶的出租汽车,若停车上客,易导致后方车辆（）。', 'A': 'A.侧面撞击', 'B': 'B.追尾碰控', 'C': 'C.迎面撞击', 'D': 'D.出现故障', 'T': 'B'}, {'题目': '遇紧急情况避险时,出租汽车驾驶员首先要尽量做到（）。', 'A': 'A.财产不受损失', 'B': 'B. 人员不受伤害', 'C': 'C.车辆不受损失', 'D': 'D.道路设施不受损失', 'T': 'B'}, {'题目': '车辆前轮胎爆裂,已出现转向时,驾驶员应在控制住方向的情况下,（ ）使车辆缓慢减速。', 'A': 'A.迅速熄火', 'B': 'B.拉紧驻车制动器', 'C': 'C.轻踏制动踏板', 'D': 'D.迅速踏下制动踏板', 'T': 'C'}, {'题目': '行车过程中,车辆后轮胎爆裂时,驾驶员应保持镇定,（  ）,控制车辆保持直线行驶,减速停车。', 'A': 'A.迅速向爆胎一侧转动转向盘', 'B': 'B.双手握稳转向盘', 'C': 'C.迅速向爆胎另一侧转动转向盘', 'D': 'D.迅速踏下制动踏板', 'T': 'B'}, {'题目': '夜间行车时,出租汽车车灯突然熄灭,应()。', 'A': 'A.观察前后车辆,减速靠边停车', 'B': 'B.利用惯性,慢慢停车', 'C': 'C.紧急制动,原地停车', 'D': 'D.特别注意减速慢行', 'T': 'A'}, {'题目': '行车中制动突然失灵时,驾驶员要沉着镇静,握紧转向盘,()进行减速。', 'A': 'A.连续踩踏制动踏板', 'B': 'B.利用“抢挡”或驻车制动', 'C': 'C.迅速踏下离合器踏板', 'D': 'D.迅速熄火', 'T': 'B'}, {'题目': '高速行驶的车辆,在转向失控的情况下使用紧急制动,很容易造成()。', 'A': 'A.爆炸', 'B': 'B.翻车', 'C': 'C.爆胎', 'D': 'D.熄火', 'T': 'B'}, {'题目': '驾驶出租汽车行驶中感到车身倾斜,并且倾斜随行驶时间的延长而加重时,一般情况下是一侧轮胎（）。', 'A': 'A.爆胎', 'B': 'B.泄气', 'C': 'C.磨损', 'D': 'D.松动', 'T': 'B'}, {'题目': '出租汽车驾驶员在载客运耆过程中,为加强治安防范应当对()的乘客要提高警惕。', 'A': 'A.热情', 'B': 'B.沉默寡言', 'C': 'C.好奇', 'D': 'D.诡秘不安', 'T': 'D'}, {'题目': '出租汽车驾驶员在遇劫后,要注意自我保护,特别要注意()安全。', 'A': 'A.生命', 'B': 'B.财产', 'C': 'C.车辆', 'D': 'D.劫匪', 'T': 'A'}, {'题目': '为保障安全,出租汽车驾驶员在载客过程中,尽量不要（）。', 'A': 'A.与乘客交谈', 'B': 'B.饮食乘客提供的东西', 'C': 'C.打开空调', 'D': 'D.打开音响', 'T': 'B'}, {'题目': '为加强安全防范,出租汽车驾驶员遇到()乘客时要格外警惕。', 'A': 'A.语无伦次、诡秘不安', 'B': 'B.携带行李、匆忙上车', 'C': 'C.主动攀谈、热情外向', 'D': 'D.穿戴整齐、举止文明', 'T': 'A'}, {'题目': '一辆出租汽车在某地被歹徒抢劫,案发后出租汽车驾驶员用电话向公安机关报警,他应当拨打()。', 'A': 'A.120', 'B': 'B.122', 'C': 'C.119', 'D': 'D.110', 'T': 'D'}, {'题目': '火药、炸药、起爆药属于危险化学品中的（）。', 'A': 'A.氧化性物质', 'B': 'B.易燃固体', 'C': 'C.爆炸品', 'D': 'D.毒害品', 'T': 'C'}, {'题目': '下列危险化学品中属于易燃固体的是()。', 'A': 'A.火柴', 'B': 'B烟花', 'C': 'C.电石', 'D': 'D.燃油', 'T': 'A'}, {'题目': '硫酸、硝酸、盐酸属于危险化学品中的()。', 'A': 'A.毒性物质', 'B': 'B.腐蚀性物质', 'C': 'C.氧化性物质', 'D': 'D.易燃性物质', 'T': 'B'}, {'题目': '硫磷、火柴属于危险化学品中的()。', 'A': 'A.爆炸品', 'B': 'B易燃固体', 'C': 'C.自燃物品', 'D': 'D.放射性物质', 'T': 'B'}, {'题目': '下列物质中遇水放出易燃气体的是()。', 'A': 'A.火柴', 'B': 'B.氯气', 'C': 'C.黄磷', 'D': 'D.电石', 'T': 'D'}, {'题目': '出租汽车乘客可以携带以下哪项物品乘车()。', 'A': 'A.鞭炮', 'B': 'B.硫酸', 'C': 'C.生漆', 'D': 'D.白酒', 'T': 'D'}, {'题目': '传递社会正能量要求出租汽车驾驶员传播()。', 'A': 'A.鞭炮', 'B': 'B.硫酸', 'C': 'D.小道消息', 'D': 'C.不满情绪', 'T': 'B'}, {'题目': '出租汽车驾驶员()直接关系到城市的文明形象和社会风气。', 'A': 'A.企业规章', 'B': 'B.精神文明', 'C': 'D.从业经历', 'D': 'C.教育程度', 'T': 'A'}, {'题目': '从长远看,出租汽车驾驶员承担社会责任与获得经济效益之间的关系是（）。', 'A': 'A.职业道德水平', 'B': 'B.服务单位', 'C': 'D.此消彼长', 'D': 'C.不成比例', 'T': 'A'}, {'题目': '小张在出租汽车运营中始终把乘客的生命财产安全放在第一位,安全驾驶、文明行车。他的行为()。', 'A': 'A.符合社会责任要求', 'B': 'B.符合快捷到达要求', 'C': 'C.符合乘客的特殊需求', 'D': 'D.符合拒载要求', 'T': 'A'}, {'题目': '（ ）和法律是维护社会秩序稳定的两种重要手段。', 'A': 'A.帮扶', 'B': 'B.教育', 'C': 'C.制度', 'D': 'D.道德', 'T': 'D'}, {'题目': '爱岗敬业是出租汽车驾驶员()的前提。', 'A': 'A.优质服务', 'B': 'B.继续从业', 'C': 'C.获得荣誉', 'D': 'D.提高收入', 'T': 'A'}, {'题目': '出租汽车驾驶员应以（ ）赢得乘客尊重,满足社会需求。', 'A': 'A.良好的服务态度', 'B': 'B.牺牲部分应得利益', 'C': 'C.尽可能快的运送速度', 'D': 'D.无条件满足乘客', 'T': 'A'}, {'题目': '出租汽车驾驶员应自觉守法律法规和服务规范,牢固树立()的观念。', 'A': 'A.经济效益第一', 'B': 'B.安全运营,优质服务', 'C': 'C.安全运营与经济利益并重', 'D': 'D.效率至上,快速运送', 'T': 'B'}, {'题目': '文明行车要求出租汽车驾驶员做到“礼让三先”,“礼让三先”不包括()。', 'A': 'A.先让', 'B': 'B.先慢', 'C': 'C.先停', 'D': 'D.先行', 'T': 'D'}, {'题目': '出租汽车驾驶员文明驾驶行为不包括（）。', 'A': 'A.宁停三分,不抢一秒', 'B': 'B.礼让行人，安全为上', 'C': 'C.礼让三先', 'D': 'D.盛气凌人,赌气开车', 'T': 'D'}, {'题目': '出租汽车驾驶员在运营过程中,因车辆或驾驶员原因造成车辆停驶时,应()计费。', 'A': 'A.取消', 'B': 'B.重新', 'C': 'C.终止', 'D': 'D.暂停', 'T': 'D'}, {'题目': '运营结束后,岀租汽车驾驶员应在允许停车路段按乘客目的地就近靠路边停车,并（）计费。', 'A': 'A.取消', 'B': 'B.重新', 'C': 'C.终止', 'D': 'D.暂停', 'T': 'C'}, {'题目': '巡游车计程计价设备应按质量技术监督部门的要求进行', 'A': 'A.定期检定', 'B': 'B.不定期检定', 'C': 'C.定期更换', 'D': 'D.定期维修', 'T': 'A'}, {'题目': '网约车运价实行(),当地政府认为有必要的可以实行政府指导价。', 'A': 'A.政府定价', 'B': 'B.行业协会定价', 'C': 'C.市场调节价', 'D': 'D.驾驶员与乘客协议价', 'T': 'C'}, {'题目': '下列哪种行为不会造成燃料浪费？', 'A': 'A.发动机怠速时踩踏加速踏板', 'B': 'B.发动机长时间空转', 'C': 'C.合理选择挡位行车', 'D': 'D.将冷却液温度保持在教低水平', 'T': 'C'}, {'题目': '一股情况下,经济车速是汽车最高设计车速的()。', 'A': 'A.40%至50%', 'B': 'B.50%至75%', 'C': 'C.70%至85%', 'D': 'D.80%至95%', 'T': 'B'}, {'题目': '轮胎气压过低会增大轮胎的(),油耗会显著增加。', 'A': 'A.滚动阻力', 'B': 'B.空气阻力', 'C': 'C.负荷', 'D': 'D.寿命', 'T': 'A'}, {'题目': '汽车频繁地变换车速,使车辆的油耗', 'A': 'A.减少', 'B': 'B.增加', 'C': 'C.不变', 'D': 'D.无影响', 'T': 'B'}, {'题目': '道路交通事故发生后,有故意破坏、伪造现场、毁灭证据等行为的当事人将承担()。', 'A': 'A.全部责任', 'B': 'B.主要责任', 'C': 'C.次要责任', 'D': 'D.同等责任', 'T': 'A'}, {'题目': '道路交通事故发生后,出租汽车驾驶员应如实讲清事故发生的()、接触部位、人员伤势和车辆损坏程度等简要情况,并听候公安交管部门的处理,不得伪造肇事现场、肇事逃逸。', 'A': 'A.时间、地点', 'B': 'B.时间、经过', 'C': 'C.地点、经过', 'D': 'D.时间、姓名', 'T': 'A'}, {'题目': '出租汽车驾驶员对行人或非机动车故意制造交通事故的当事人应采取的做法是()。', 'A': 'A.立即报警请求处理', 'B': 'B.给点钱了事别耽误生意', 'C': 'C.找“能人”调和', 'D': 'D.花钱免灾', 'T': 'A'}, {'题目': '在高速公路上发生交通事故时,将人员疏散至以下哪个区域能够保证安全?', 'A': 'A.高速公路中间隔离带', 'B': 'B.高速公路外侧行车道', 'C': 'C.高速公路以外的区域', 'D': 'D.高速公路内侧行车道', 'T': 'C'}, {'题目': '发生交通事故后当事人逃逸的,由逃逸的当事人承担', 'A': 'A.主要责任', 'B': 'B.次要责任', 'C': 'C.全部责任', 'D': 'D.部分责任', 'T': 'C'}, {'题目': '出租汽车发生下列哪类火灾可以用水扑救?', 'A': 'A.轮胎起火', 'B': 'B.柴油起火', 'C': 'C.汽油起火', 'D': 'D.发动机起火', 'T': 'A'}, {'题目': '使用车载灭火器灭火时,应该将灭火器对准', 'A': 'A.火苗', 'B': 'B.火焰中部', 'C': 'C.火源根部', 'D': 'D.火源附近部位', 'T': 'C'}, {'题目': '有心脏病和肺病的患者,呼吸困难时可保持()姿势。', 'A': 'A.下蹲', 'B': 'B.平卧', 'C': 'C.侧卧', 'D': 'D.半坐', 'T': 'D'}, {'题目': '出租汽车驾驶员抢救伤员时,应', 'A': 'A.先治伤,后救命', 'B': 'B.先救命,后治伤', 'C': 'C.仅救治重伤员', 'D': 'D.仅救治轻伤员', 'T': 'B'}, {'题目': '发生道路交通事故或乘客意外事件,出租汽车驾驶员对乘客病情判断后,需立即救护的,应尽快拨打救援电话,必须简洁地表达()。', 'A': 'A.人、地、状况、救护措施', 'B': 'B.人、地、时间、经过', 'C': 'C.人、地、救护措施、经过', 'D': 'D.人、时间、经过、状况', 'T': 'A'}, {'题目': '发生道路交通事故或乘客意外事件后,出租汽车驾驶员做好应急救护的目的是()。', 'A': 'A.减少个人损失', 'B': 'B.挽救生命减轻伤残', 'C': 'C.彰显个人英雄主义', 'D': 'D.向乘客索要报酬', 'T': 'B'}, {'题目': '巡游出租汽车驾驶员在站点候客时,应()。', 'A': 'A.按顺序排队', 'B': 'B.视情插队及时载客', 'C': 'C.雇人协助揽客', 'D': 'D.挑选到合适乘客立即出发', 'T': 'A'}, {'题目': '网络预约出租汽车经营者对于服务过程中发生的安全责任事故等,应()。', 'A': 'A.承担后行赔付责任', 'B': 'B.承担先行赔付责任', 'C': 'C.向乘客转移运输服务风险', 'D': 'D.向驾驶员转移运输服务风险', 'T': 'B'}, {'题目': '出租汽车驾驶员运营期间,遇乘客要求的行驶路线与地图导航软件规划的路线不一致时,应()。', 'A': 'A.终止服务', 'B': 'B.尊重乘客意愿', 'C': 'C.加收服务费', 'D': 'D.仍按地图导航软件规划路线行驶', 'T': 'B'}, {'题目': '出租汽车驾驶员接单后,如遇乘客未按约定时间到达上车点、且无法取得联系的,驾驶员应()。', 'A': 'A.直接离开', 'B': 'B.继续等待', 'C': 'C.与经营者联系,经同意后方可离开', 'D': 'D.给乘客留言后离开', 'T': 'C'}, {'题目': '巡游出租汽车驾驶员站点候客时,()。', 'A': 'A.可以下车私自揽客', 'B': 'B.根据自已需要挑选乘客', 'C': 'C.根据乘客需要就近上客', 'D': 'D.服从站点管理按序排队、顺序发车、不挑乘客', 'T': 'D'}, {'题目': '网络预约出租汽车驾驶员小李成功接单后又接到家里的电话,要求回家接孩子放学,小李的正确做法是O。', 'A': 'A.要求乘客取消订单', 'B': 'B.按约定到达乘客上车地点继续提供服务', 'C': 'C.延迟前往乘客约定地点', 'D': 'D.关闭联系方式', 'T': 'B'}, {'题目': '乘客上车前,巡游出租汽车驾驶员O。', 'A': 'A.不得询问乘客目的地', 'B': 'B.可以询问乘客目的地', 'C': 'C.可以和乘客议价', 'D': 'D.可以拒载', 'T': 'A'}, {'题目': '在O情况下,出租汽车驾驶员可以谢绝或中断服务。', 'A': 'A.因路途遥远,驾驶员不愿意前往的', 'B': 'B.乘客携带易燃易爆危险品上车的', 'C': 'C.乘客年龄较大、行动不便', 'D': 'D.乘客不允许搭载其他乘客的', 'T': 'B'}]


#第一套的判断题
pd_1=[{'题目': '出租汽车驾驶员从业资格包括巡游出租汽车驾驶员从业资格和网络预约出租汽车驾驶员从业资格等。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '申请人若首次参加出租汽车驾驶员从业资格考试，其全国公共科目和区域科目考试可在不同的区域完成。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '投入运营的出租汽车车辆应当安装具有行驶记录功能的车辆卫星定位装置、应急报警装置。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '根据国家关于深化出租汽车改革的要求，严禁出租汽车企业向驾驶员收取高额抵押金，现有抵押金过高的要降低。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '新增巡游出租汽车经营权全部实行无偿使用，但可以变更经营主体。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车综合服务区应当为进入服务区的出租汽车驾驶员免费提供餐饮、修理等服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '城市人民政府要优先发展公共交通，适度发展出租汽车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游出租汽车和网络预约出租汽车应实行错位发展和差异化经营，为社会公众提供品质化、多样化的运输服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '取得从业资格证的出租汽车驾驶员，应当经出租汽车行政主管部门从业资格注册后，方可从事出租汽车客运服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网络预约出租汽车驾驶员的注册，通过出租汽车经营者向发证机关所在地出租汽车行政主管部门报备完成。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '个体出租汽车经营者自己驾驶出租汽车从事经营活动的，不需要申请办理从业资格注册手续。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应到其所属的出租汽车企业完成注册。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在从业资格注册有效期内，与出租车经营者解除劳动合同的，应当申请注销从业资格证。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员取得从业资格证后超过1年未申请注册的，注册后上岗前应当完成不少于27学时的继续教育。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员继续教育由出租汽车经营者组织实施。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员办理注册后应将从业资格证交由出租汽车经营者保管。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '网约车按照高品质服务、差异化经营的原则，有序发展。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车平台公司承担承运人责任，应当保证运营安全，保障乘客合法权益。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车平台公司暂停或者终止运营的，应当通告提供服务的车辆所有人和驾驶员。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车平台公司应与驾驶员签订劳动合同或者协议，明确双方的权利和义务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车平台公司在提供网约车服务时，应当提供驾驶员姓名、照片、手机号码和服务评价结果，以及车辆牌照等信息。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车平台公司不得妨碍市场公平竞争，不得为排挤竞争对手而以低于成本的价格运营扰乱正常市场秩序。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车驾驶员应当为乘客购买承运人责任险。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '网约车平台公司和驾驶员可以向第三方有偿提供驾驶员、约车人和乘客的相关个人信息。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '任何企业和个人不得向未取得合法资质的车辆、驾驶员提供信息对接开展网约车经营服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '任何企业和个人不得以私人小客车合乘名义提供网约车经营服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车车辆和驾驶员不得通过未取得经营许可的网络服务平台提供运营服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车只要行驶里程未达到60万千米，就可以允许经营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '使用年限达到8年但行驶里程未达到60万千米的网约车，应当退出经营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '小、微型非营运载客汽车登记为预约出租客运的，行驶里程达到60万千米时强制报废。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '除小、微型非营运载客汽车外，其他小、微型营运载客汽车登记为预约出租客运的，按照该类型营运载客汽车报废标准和网约车报废标准中先行达到的标准报废。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '国家鼓励巡游出租汽车实行规模化、集约化、个体化经营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应当做好运营前例行检查，保持车辆设施、设备完好，车容整洁。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应当衣着整洁，语言文明，主动问候，提醒乘客根据意愿选择是否系安全带。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应当根据乘客意愿升降车窗玻璃及使用空调、音响、视频等服务设备。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '为提高车辆使用效率，出租汽车驾驶员在客流高峰时段，可以不经乘客同意搭载其他乘客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应当遵守道路交通安全法规，文明礼让行车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员发现乘客遗失财物，设法及时归还失主。无法找到失主的，可由自己保存。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '乘客要求去偏远、冷僻地区或者夜间要求驶出城区的，出租汽车驾驶员有权直接拒绝提供服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员发现乘客遗留可疑危险物品的，应当立即报警。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员接单后，应当按照约定时间到达约定地点。乘客未按约定候车时，驾驶员可直接自行撒单。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶员有私自转包经营等违法行为的，巡游出租汽车经营者应当予以纠正；情节严重的，可按照约定解除合同。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游出租汽车经营者应当通过建立替班驾驶员队伍、减免驾驶员休息日经营承包费用等方式保障出租汽车驾驶员休息权。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游出租汽车经营者应当合理确定承包、管理费用，可以适当向驾驶员转嫁投资和经营风险。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '巡游出租汽车经营者应当根据经营成本、运价变化等因素及时调整承包费标准或者定额任务等。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '国家鼓励、支持和引导出租汽车企业、行业协会与出租汽车驾驶员、工会组织平等协商，合理确定并动态调整出租汽车承包费标准或定额任务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '有交通肇事犯罪记录的出租汽车驾驶员，将由发证机关撤销其从业资格证，并公告作废。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租车驾驶员不再具备从业条件的，出租汽车行政主管部门将依据相关法律法规撤销或者吊销其从业资格证件。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '转借、出租、涂改从业资格证的，由县级以上出租汽车行政主管部门责令改正，并处1万元以上3万元以下的罚款。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车是城市公共交通的组成部分。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '新增和更新出租汽车，应当使用新能源汽车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '巡游出租汽车驾驶员如无法继续从事经营的，可以将承包经管权转包给其他驾驶员。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '新增出租汽车经营权一律实行期限制，不得再实行无期限制。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '取得从业资格证件但在考核周期内未注册在岗的，仍需参加出租汽车驾驶员服务质信誉考核。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员服务质量信誉考核工作每年进行一次。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员一个考核周期届满，经签注服务质量信誉考核等级后，该考核周期内的扣分与加分予以清除，不转人下一个考核周期。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员违反服务质量信誉考核指标的，一次扣分分值分别为1分、3分、5分、10分、20分共5种。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员可以在不增加行驶里程的情况下，另载他人，无需征得乘客同意。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员可以将对自已服务不满意的乘客转给其他出租汽车或中止服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '车辆起步前，出租汽车驾驶员应检查车门是否关好。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '乘客到达目的地后，在不影响通路交通和行人安全的情况下，应在允许停车路段按乘客的要求就近停车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '当乘客在禁停路段扬手招车时，为了减少不必要的投诉，驾驶员应停车载客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '载客过程中如因客观原因确需绕道时，出租汽车驾驶员应主动向乘客说明情况，如乘客不同意绕行要求下车时，可以拒绝乘客下车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员发现乘客遗失物应该及时归还或者上交。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员发现乘客遗留物品，若找不到失主，可自行处理。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员载客途中无正当理由中断服务的视为中途甩客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车运营过程中，乘客要求使用空调、音响等设备时，驾驶员可以婉言拒绝。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '为提供良好服务，出租汽车驾驶员只要看到乘客扬手招车，必须马上停车载客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '如果乘客要求下车的路段禁止停车，出租汽车驾驶员应婉拒并耐心向乘客解释，至可下车地点停车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '外地乘客乘坐出租汽车时询问驾驶员当地的风景名胜等与目的地无关的地方，驾驶员可以不予理睬。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员运营过程中不得向来客推销购物、饮食和休闲娱乐等项目。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营过程中，征得乘客同意后可以在车内吸烟。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员小王接班后发现自己一点零钱也没有准备，但赚钱时间要紧，先开上路，让乘客支付零钱就可以了。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员进入服务站点后可以插队，以提高运营效率。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在交班途中，可以询问乘客目的地是否与自已交班同方向，以确定是否载客，不耽误交班。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '乘客上下出租汽车时，驾驶员应引导乘客由右侧上下车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '乘客上出租汽车时，驾驶员应主动协助乘客提拿行李，乘客应主动关闭行李舱。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '为保证行车安全，出租汽车驾驶员应提醒并在必要时协助乘客系好安全带。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员出车前应检查车容车貌、车辆技术状况、燃油或燃气，并备好随车设施、工具。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员因特殊情况不能完成栽客服务的一律视为拒载或甩客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '网络预约出租汽车可以在巡游出租汽车营运站点候客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '无论经营者采取派单机制还是抢单机制，网络预约出租汽车驾驶员收到订单信息后，必须接单。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员接单后，未到达约定上车地点时，不应提前确认车辆已到达。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员接单后，若去往乘客目地的路况不好，可以要求乘客取消订单。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '向网络服务平台发送预约用车请求的人，必须是乘客本人。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员接单后，按约定时间到达上车地点，即可向经营者发送乘客上车确认信息。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应随身携带从业资格证。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员接单后，应等待乘客联系自己，确认上车时间及地点。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车车辆标志全国统一。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员接单后，乘客上车后目的地发生变化的，费用按实际行程收取。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网络预约出租汽车驾驶员待乘客上车后，可提示乘客使用客户端应用程序中的车辆位置信息实时分享功能。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '未经约车人或乘客同意，网络预约出租汽车驾驶员未按承诺到达约定上车地点提供服务的行为视为拒载。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游出租汽车驾驶员收听到乘客电召服务需求信息后，必须提供相应服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '乘客下车时，出租汽车驾驶员可以向乘客索取小费。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员因修路等客观原因确需绕道的，可以不用向乘客说明以避免纠纷。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车车辆，使用达5年的强制报废。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '无障碍出租汽车不用设置专用标志。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车车况良好，可由出租汽车企业向主管部门申请免去年检，直接领取年检合格证。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中应根据乘客的要求使用空调、音响等设备，不得无故拒绝。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车办理有效的机动车号牌和行驶证后，即符合运营资质。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车应配备合格的消防器材，并按要求定期检查。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车车辆内外可根据商家要求张贴商业广告。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '无障碍出租汽车应保证充足空间安放轮椅。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车车辆号牌应当清晰，固定端正，无遮挡物、反光物。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车车厢内应整洁、卫生，无杂物、异味。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车行李厢内可供乘客放置行李物品的空间不得少于行李厢的三分之一。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车应保持车门功能正常，车窗玻璃封闭良好，洁净明亮，无遮蔽物，升降自如。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车应当仪表完好、整洁，仪表台不得放置与运营无关的物品。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车遮阳板、化妆镜、顶棚应齐全完好洁净。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车安全带和锁扣应齐全、有效、无污渍。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '遇有流行传染病时，出租汽车要做好有针对性的消毒工作。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车车身内外应清洁完好，漆皮完整无损，可按自己的爱好做个性化装饰。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车座椅应牢固无塌陷，前排座椅可前后移动，倾度可调。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '小李驾驶的出租汽车雨刮器坏了，考虑到正值少雨季节，他可以不必立即送修，以免耽误运营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '无障碍出租汽车是指由残疾人驾驶的出租汽车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中应做到端庄大方，举止文明。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '夏天天气炎热，出租汽车驾驶员在运营过程中可以穿背心，短裤。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '女性出租汽车驾驶员上岗时浓妆是塑造美好形象、尊重乘客的表现。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '男性出租汽车驾驶员发型要求整齐大方，不留怪异的发型。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员不得在车厢内吸烟、饮食。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '夏天天气炎热，多下雨，出租汽车驾驶员可以穿拖鞋运营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员要给乘客以亲切感和信任感，则需注意自身形象，着装规范，仪容大方。 ', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营过程中提倡使用普通话。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员驾驶车辆时不能吸烟，但是可以接打电话。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员与乘客交流要频繁不间断，内容文明健康。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应虚心接受乘客的批评意见，处理好与乘客的纠纷。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾教员不应有在乘客面前挖鼻、剔牙、搔头等行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营服务时不得有向车外抛物、吐痰等行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '张师傅不会讲普通话，所以不能参加出租汽车运营服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员运营期间应按规定着装。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在乘客上车时要与乘客有眼神接触。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在乘客表达不满时不应粗暴打断。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在征得乘客同意后，可以在车内吸烟。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在服务老年乘客时应尽量避免使用紧急制动。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '12周岁以下（或1.4米以下）儿室不宜坐在副驾驶位。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员切忌模仿聋哑乘客动作，取笑嘲笑对方。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应以“乘客至上”为宗旨，满足乘客对语言、用车便利、设施等方面的需求。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在接待老弱乘客时，要面带笑容、说话温和、使用尊称。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在接待老弱来客时，要尽量快速行驶，弥补上下车时耽误的时间。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '儿童好奇心强，活泼好动，乘车时喜好将头、手伸出窗外，驾驶员遇儿童乘客应当着重提醒并在必要时给予训诫，保证乘车安全。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员不必尊重乘客的宗教信仰和风俗习惯，各取所好。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在运营过程中不得有抢客、强行揽客、甩客、倒客，未经乘客同意强行拼客等行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员为保降安全可以随时翻包检查乘客携带行李物品。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '利用计程计价设备作弊收取车费是出租汽车服务中的违法行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车经营者应定期开展服务质量评价，并不断改进服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应保服务质量统计数据和原始记录真实、准确，接受出租汽车行政主管部门的服务质量信誉考核。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '对待乘客投诉，出租汽车驾驶员应保持理性、平和的心态。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车经营者应按规定设置服务监督机构及办公地点，但可以不设服务监督电话。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车经营者接到乘客投诉后，应当在24h内处理，并及时将处理结果告知乘客。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '乘客下车时，出租汽车驾驶员应提醒乘客通过客户端、拨打服务监督电话等形式对其服务评价为优。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车服务评价指标中，要求乘客投诉处理率和乘客满意率均达到100%.', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '乘客投诉会给出租汽车驾驶员带来麻烦，所以驾驶员可以不配合投诉处理。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '乘客对出租汽车服务质量有疑问，可拨打经营者服务监督电话、出租汽车行政主管部门电话等方式进行咨询、投诉。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网络预约出租汽车驾驶员因骚扰、吸毒、超速等方面遭到投诉的，经营者应当暂停该驾驶员提供服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员的心理素质是安全行车重要影响因素之一。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '行车中做到集中注意力、仔细观察和提前预防是出租汽车驾驶员安全意识的具体表。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员驾驶车辆时保持心情舒畅、平心静气，有助于安全行车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员的个性心理特征对安全行车没有影响。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员克服和控制急躁、愤怒等消极情绪，有助于减少行车中道路交通事故。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '心理疲劳是一种常见的心理现象，只要驾驶技术好就可以避免出租汽车运营安全事故的发生。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员小王因营业收入比其他同行收入较低，心理感觉不平衡，在运营中出现争道抢行的行为，其行为可理解。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶员行车中的包容、礼让有助于提高道路运输安全。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在行车中无论遇到什么情况，当发现自己情绪不稳定时，要进行自我调节和疏导。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在运营过程中，以最快速度到达目的地比安全文明行车更重要。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员有不良情绪，可以发泄到乘客身上。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '主动下车帮乘客搬运行李，有利于缓解长时间保持坐姿带来的疲劳。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员要定期体检，时刻关注自己的身体健康问题，这样既是对自己负责，也是对他人和社会负责。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '酒精会麻醉、抑制中枢神经，影响出租汽车驾驶员的判断力，降低视觉敏锐度，使其不能正确有效地控制出租汽车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员只要其驾驶技术娴熟，吸烟对行车安全影响不大。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇挣剂、兴奋剂、抗生素、抗过敏药物、治疗胃、肠消化系统和心血管系统的药物，按其临床作用不会对出租汽车驾驶员有影响。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员长时间保持固定姿势容易使腰部疲劳。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '音响、空调、计程计价设备、车载卫星定位系统是否正常是出租汽车安全检视的重要内容。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '检视发动机、底盘主要看其有无遗洒、泄露。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出车前检视车辆后视镜主要看其是否完好、角度是否调整得当。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应该对出租汽车做好日常安全检视的工作，如有故障应及时送修，避免在运营途中出现问题，既影响安全又影响运营收入。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶室内空气质量、温度、噪声等环境因素与驾驶员疲劳关系不大。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '保证足够的睡眠时间和良好的睡眠质量是预防驾驶员疲劳驾驶的有效措施。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在服用国家管制的精神药品后，若自我感觉良好，可以驾驶车辆运营。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '当行驶到城乡结合部，占道经营的摊点较多，易出现人员拥挤、交通拥堵的情况时，出租汽车驾驶员应小心谨慎、礼让行驶。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '行车中遇到车流缓慢或者周边车辆有不文明驾驶行为时，驾驶员应做好自我控制，避免产生急躁、愤怒情绪，影响运营安全。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员只要具备了较高的驾驶技能，就能避免道路交通事故的发生。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '夜间行车，驾驶员视距变短，注意力高度集中，易产生疲劳。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '雾天驾驶要打开雾灯、远光灯，降低车速，保持较大的跟车距离。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '在冰雪道路上行车时，由于积雪对光线的反射，易造成驾驶员目眩。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '雪天驾驶出租汽车行驶，轻踩制动或缓打转向时，易导致侧滑、甩尾、转向失控。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '高温天气驾驶出租汽车行驶，当感到视线模糊、反应迟钝时要及时停车休息。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '雨天行驶，光线昏暗、能见度低，驾驶员视线易受影响，无法清晰观察路况，但只需打开前照灯就能防止上述现象发生。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '高温天气行驶，车辆轮胎温度高，行驶中易发生爆胎。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '雾天能见度低，看不清前方路况，应进入应急车道行驶相对安全。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶出租汽车通过无人看守的铁路道口，要加速通过。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶出租汽车通过扬尘路段时，要低速慢行，必要时可以开启车灯示意。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶出租汽车遇到窄路、坡道、急转弯处会车时，要低速慢行，必要时停车等待。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在高速公路行车如遇到前方汽车排队，在乘客要求的前提下可以在紧急停车带上行驶。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '雨天驾驶出租汽车要与路边行人保持更大的间距，避免泥水溅污行人。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '雾天能见度较低时，驾驶出租汽车应开启雾灯、近光灯、示廓灯，必要时开启危险报警闪光灯。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出现险情时，驾驶员应保持头脑清醒，情绪镇定是做好避险的先决条件。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '车速较高时遇到紧急情况，驾驶员应采取急转方向避让，以减小碰撞损坏程度。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶出租汽车行驶中发生爆胎时，应向相反方向急转转向盘或急踩制动踏板。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '行车中发动机突然熄火，不能起动时，驾驶员应打开危险报警闪光灯，原地立即停车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '车辆高速行驶，遇转向突然失控时，驾驶员应使用紧急制动尽快将车停下，防止事故发生。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '车辆发生侧滑时，驾驶员应立即松拾制动踏板，并迅速向侧滑的相反方向转动转向盘，修正方向后继续行驶。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '因转向或擦撞引起车辆侧滑时，驾驶员应立即踩踏制动踏板减速，并迅速向侧滑的一方转动转向盘。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '车辆行驶中，发现轮胎泄气时，驾驶员应握稳转向盘，缓慢制动减速，停靠在路边安全地点。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '车辆因轮胎泄气驶离行车道时，驾驶员不要采用紧急制动，以免造成翻车或造成后车追尾。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '车辆因故障必须停车时，在不影响其他车辆行驶的前提下，驾驶员可在行车道缓慢停车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '在高速公路上行车，如车辆发生故障需要临时停车时，应将车停至应急车道，并立即在车后方150米外放置警告标志。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶出租汽车遇紧急情况避险时要先考虑人的安全，先人后物。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶出租汽车行驶途中，油路或电路故障容易导致发动机突然熄火。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶出租汽车行驶中，制动突然失效，一次拉紧驻车制动器容易将驻车制动盘“抱死”，损坏传动机件，丧失制动力。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '驾驶出租汽车行驶中，制动突然失效，使用驻车制动器辅助制动时，可将操纵杆一次拉紧。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶出租汽车通过弯道时，可以加速超车，提高通行效率。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车具有单人单车运营、流动、分散运营等特点，驾驶员应充分认识运营治安问题的严峻性，提高防范意识。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员在遇劫后，要注意自我保护，在财产和生命安全面前，应当首先考虑财产安全。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员运营过程中如发现有其他车辆发出求救信号时，应当尽量协助，并迅速拨打救援电话。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车遇劫时，可使用车载卫星定位系统报警。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员遇到抢劫犯罪，应临危不惧，胆大心细，拼尽全力制服罪犯。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '易燃液体一旦起火，应立即用水扑救。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '酒精、黄磷、农药都属于危险化学品。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '烟花、爆竹、火柴都属于危险化学品中的爆炸品。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '方便百姓、优质服务是出租汽车驾驶员社会责任在服务广大群众出行方面的体现。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '救死扶伤、提供援助是出租汽车驾驶员的社会责任，因此不能考虑自身安危。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '不做有损城市形象的事，不信谣、不传谣是对出租汽车驾驶员承担社会责任的要求。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员义务为高考学生提供接送服务是无私奉献社会的行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员只有做到诚实守信、文明服务，才能赢得乘客认可，提高职业信誉。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员职业道德水平与出租汽车服务质量没有直接关系。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '文明服务要求出租汽车驾驶员形象文明、语言文明、态度文明和举止文明等。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '拒载、故意绕道行驶等行为违背了出租汽车驾驶员诚信经营的职业道德。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车行业是典型的服务业，出租汽车驾驶员从业期间应当树立盈利至上的从业意识。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '“爱国、敬业、诚信、友善”，是公民基本道德规范，是从个人行为层面对社会主义核心价值观基本理念的凝练。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游车和网约车运价均实行政府定价或政府指导价，出租汽车驾驶员必须遵照执行。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '巡游车和网约车均应当依法经营、诚实守信、市场定价、优质服务。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '巡游车和网约车均应当配置统一的标志顶灯和计程计价设备。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '巡游车运价实行政府定价或政府指导价，并依法纳入政府定价目录。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '巡游车计程计价设备显示的车费已经包含车辆通行费，不得向乘客另外收取。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员在本区域内运营过程中，可以依据燃油价格等因素与乘客协议确定车费。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车时距并计是指载客营运时按照行驶时间和里程同时计费的方式。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应当按照规定使用计程计价设备，执行收费标准并主动出具有效车费票据。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车运价一律实行市场调节价。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '网约车运价实行政府定价，城市人民政府认为有必要实行政府指导价的除外。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '网约车平台公司应当按照规定确定计程计价方式，不得有不正当价格行为。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '网约车实行市场调节价，不需要向乘客提供相应的出租汽车发票。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '空气滤清器太脏会阻碍空气畅通，从而减少燃油消耗。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '当车速过高时，空气阻力明显增大，燃油消耗随着车速的增加而增加。因此，车速过高不利于节省燃油。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '汽车在运行中，挡位的选择与换挡动作对燃油的消耗都有影响。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '行车中，驾驶员感到动力不足时，可猛踩加速踏板，增强动力，防止频繁换挡，这样可以节约燃料。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '不必要的加速、减速和停车都将增加废气排放。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '较长时间停车时，应将发动机关闭，可以节约燃油消耗，减少汽车废气排放。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '在道路上发生交通事故，仅造成轻微财产损失，且基本事实清楚的，当事人应当先撤离现场，再进行协商处理。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '饮酒或醉酒驾驶出租汽车造成重大交通事故，构成犯罪的，依法追究刑事责任，驾驶证，终身不得重新获得机动车驾驶证。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '道路交通事故适用简易程序处理完毕后，当事人应立即撤离现场，恢复交通。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '发生道路交通事故后，肇事车逃逸时，驾驶员要记清肇事车辆的车型、颜色、特征及逃逸方向，以及逃逸驾驶员的体貌特征等。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '发生未造成人身伤亡的道路交通事故后，双方协商未达成一致的，出租汽车驾驶员要及时拨打报警电话。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '发生道路交通事故，驾驶员应当设法让乘客远离事故现场，选择安全的地方等待，以防发生二次事故。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '使用灭火器灭火时，人要站在下风处，灭火器要瞄准火苗。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '车辆发动机起火时应迅速关闭发动机，打开发动机罩灭火。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '驾驶出租汽车行车中突遇地震时，应组织乘客躲在出租汽车里，不要下车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '出租汽车驾驶员应掌握一定的救护知识，当乘客在车上突发疾病时能采取力所能及的救护，实施抢救。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '发生道路交通事故后，向120求助时，应详细说明受伤人员伤情，以便救护人员带齐药品和器械实施有效的救助。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '出租汽车驾驶员应当积极参与自然灾害、事故灾难、公共卫生事件和社会安全事件等突发事件的应对工作。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '车辆起火后，驾员救火时应张大口呼吸新鲜空气，以免缺氧。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}]


#第一套题库中的题目
data_1_list=choice_1+pd_1

#############################################

#第二套的选择题
choice_2=[{'题目': '白城市总人口大约()人：', 'A': 'A.200万  ', 'B': 'B.300万  ', 'C': 'C.400万', 'D': '', 'T': 'A'}, {'题目': '白城市有()个开发区：', 'A': 'A.4  ', 'B': 'B.3  ', 'C': 'C.5', 'D': '', 'T': 'A'}, {'题目': '白城市火车站位于()：', 'A': 'A.辽北路 ', 'B': 'B.强大路  ', 'C': 'C.朝阳路', 'D': '', 'T': 'A'}, {'题目': '白城市洮北区的邮政编码是()：', 'A': 'A.137000  ', 'B': 'B.137300  ', 'C': 'C.137100', 'D': '', 'T': 'A'}, {'题目': '白城市有()所中学：', 'A': 'A.5  ', 'B': 'B.6  ', 'C': 'C.4', 'D': '', 'T': 'A'}, {'题目': '白城市出租车在2.5公里路程之内的运价是():', 'A': 'A.5元 ', 'B': 'B.3元 ', 'C': 'C.7元', 'D': '', 'T': 'A'}, {'题目': '白城市汽车客运站位于()：', 'A': 'A.辽北路  ', 'B': 'B.强大路  ', 'C': 'C.朝阳路', 'D': '', 'T': 'A'}, {'题目': '白城市新城区位于幸福南大街以()：', 'A': 'A.东  ', 'B': 'B.西  ', 'C': 'C.南', 'D': '', 'T': 'A'}, {'题目': '白城市区有  (  )  家车队。', 'A': 'A. 5  ', 'B': 'B.6   ', 'C': 'C.7', 'D': '', 'T': 'A'}, {'题目': '白城市被称为“八景之一”的风景区是  (  )    。', 'A': 'A. 向海自然保护区', 'B': 'B. 莫莫格自然保护区', 'C': 'C.月亮泡保护区', 'D': '', 'T': 'A'}, {'题目': '白城市有  (  )   个少数民族乡。', 'A': 'A. 8个   ', 'B': 'B. 9个 ', 'C': 'C. 10个', 'D': '', 'T': 'A'}, {'题目': '白城市一中位于  (  )   ', 'A': 'A. 新华路   ', 'B': 'B. 辽北路 ', 'C': 'C. 洮安路', 'D': '', 'T': 'A'}, {'题目': '白城实验高中位于  (  )   ', 'A': 'A. 瑞光街   ', 'B': 'B. 幸福街 ', 'C': 'C. 长庆街', 'D': '', 'T': 'A'}, {'题目': '白城市中医院位于  (  )   ', 'A': 'A. 青年街   ', 'B': 'B. 幸福街 ', 'C': 'C. 金辉街', 'D': '', 'T': 'A'}, {'题目': '白城市出租车  (  )   ', 'A': 'A. 1817台  ', 'B': 'B. 1825台 ', 'C': 'C.1806台', 'D': '', 'T': 'A'}, {'题目': '白城市传染病医院位于三合路  (  )   ', 'A': 'A. 227号  ', 'B': 'B. 217号 ', 'C': 'C.207号', 'D': '', 'T': 'A'}, {'题目': '去白城市中心医院乘  (  )   路公交车', 'A': 'A. 1   ', 'B': 'B. 10   ', 'C': 'C. 18', 'D': '', 'T': 'A'}, {'题目': '白城市铁鹤小区位于  (  )   ', 'A': 'A. 新华路   ', 'B': 'B. 民生路 ', 'C': 'C. 中兴西大路', 'D': '', 'T': 'A'}, {'题目': '白城市传染病医院位于  (  )   ', 'A': 'A. 三合路   ', 'B': 'B. 中兴西大路 ', 'C': 'C. 辽北路', 'D': '', 'T': 'A'}, {'题目': ' 白城市有  (  )  个国家级自然保护区。', 'A': 'A. 2个   ', 'B': 'B. 3个   ', 'C': 'C.4个', 'D': '', 'T': 'A'}, {'题目': '镇赉县共  (  )   个少数民族.', 'A': 'A.20   ', 'B': 'B.25   ', 'C': 'C.18', 'D': '', 'T': 'A'}, {'题目': '中国野生动物保护协会授予镇赉县  (  )   荣誉称号。', 'A': 'A.中国白鹤之乡', 'B': 'B.中国丹顶鹤之乡', 'C': 'C.中国白鱼之乡', 'D': '', 'T': 'A'}, {'题目': '镇赉县南湖生态园位于县城南端，占地面积145万平方米，建设工期为  (  )  年。', 'A': 'A. 5年 ', 'B': 'B. 6年 ', 'C': 'C.7年', 'D': '', 'T': 'A'}, {'题目': '素有“草原明珠”之称的月亮泡位于(  )境内。', 'A': 'A.大安市 ', 'B': 'B.洮南市 ', 'C': 'C.镇赉县', 'D': '', 'T': 'A'}, {'题目': '大安市辖10个镇，   (  )  个街道.', 'A': 'A.5    ', 'B': 'B.7     ', 'C': 'C.6      ', 'D': '', 'T': 'A'}, {'题目': '大安市拥有少数民族   (  )  个.', 'A': 'A.16    ', 'B': 'B.12    ', 'C': 'C.14  ', 'D': '', 'T': 'A'}, {'题目': '经过大安市的国道有  (  )   国道. ', 'A': 'A.302    ', 'B': 'B.301     ', 'C': 'C.303    ', 'D': '', 'T': 'A'}, {'题目': '全民健身中心位于大安市  (  )    ', 'A': 'A.西部      ', 'B': 'B. 东部     ', 'C': 'C.北部    ', 'D': '', 'T': 'A'}, {'题目': ' 大安市内的初中一共有  (  )   个', 'A': 'A.3     ', 'B': 'B.4      ', 'C': 'C.5   ', 'D': '', 'T': 'A'}, {'题目': '大安市最大的购物超市繁华超市位于  (  )   街上。', 'A': 'A. 嫩江北街', 'B': 'B. 长安西街', 'C': 'C. 幸福南街', 'D': '', 'T': 'A'}, {'题目': '洮南市位于吉林省 (  )   。', 'A': 'A.西北部  ', 'B': 'B.西部  ', 'C': 'C.北部', 'D': '', 'T': 'A'}, {'题目': '洮南市的城乡总人口44万人，城镇人口  (  )   。', 'A': 'A.13.8万人  ', 'B': 'B.4.4万人  ', 'C': 'C.44万人', 'D': '', 'T': 'A'}, {'题目': '洮南市政府位于洮南市 (  ) 。', 'A': 'A.新发东路  ', 'B': 'B.新发西路 ', 'C': 'C.团结东路', 'D': '', 'T': 'A'}, {'题目': '距离洮南市区最近的飞机场是 (  ) 。', 'A': 'A.白城长安机场', 'B': 'B. 长春龙嘉机场 ', 'C': 'C.乌兰浩特机场', 'D': '', 'T': 'A'}, {'题目': '2010年11月，中国野生动物保护协会授予镇赉县  (  )   荣誉称号。(  ) 是洮南区号。', 'A': 'A.0436    ', 'B': 'B.220881    ', 'C': 'C.137100', 'D': '', 'T': 'A'}, {'题目': '洮南市卫生防疫站位于洮南市 (  )  。', 'A': 'A.育英西路  ', 'B': 'B.通达南路  ', 'C': 'C.广昌东路', 'D': '', 'T': 'A'}, {'题目': '洮南市18个乡镇其中少数民族乡 (  ) 。', 'A': 'A.2个  ', 'B': 'B.6个  ', 'C': 'C.18个 ', 'D': '', 'T': 'A'}, {'题目': '洮南市法院位于洮南市  (  ) 。', 'A': 'A.新发西路', 'B': 'B. 光明南街 ', 'C': 'C.新发东路', 'D': '', 'T': 'A'}, {'题目': '洮南市检察院位于洮南市 (  ) 。', 'A': 'A.光明南街 ', 'B': 'B.新发西路 ', 'C': 'C.新发东路', 'D': '', 'T': 'A'}, {'题目': '洮南市聚香大酒店位于洮南市 (  ) 。', 'A': 'A.富文西路  ', 'B': 'B. 建设东路 ', 'C': 'C.广昌西路 ', 'D': '', 'T': 'A'}, {'题目': '洮南市吴俊升官邸（大帅府）位于洮南市 (  ) 。', 'A': 'A.兴隆西路  ', 'B': 'B. 兴隆路中段  ', 'C': 'C.团结西路', 'D': '', 'T': 'A'}, {'题目': '洮南市西郊公园位于洮南市 (  ) 。', 'A': 'A.团结西路  ', 'B': 'B. 育英东路 ', 'C': 'C.光明南街', 'D': '', 'T': 'A'}, {'题目': '白城市有多少个国家级自然保护区：（  ）', 'A': 'A. 1个  ', 'B': 'B. B. 2个  ', 'C': 'C. C.3个', 'D': '', 'T': 'B'}, {'题目': '白城市公交车有(  )条线路在进行道路经营：', 'A': 'A.23  ', 'B': 'B.22  ', 'C': 'C.28', 'D': '', 'T': 'B'}, {'题目': '白城市位于吉林省(  )部： ', 'A': 'A.东北 ', 'B': 'B.西北 ', 'C': 'C.东南  ', 'D': 'D.西南', 'T': 'B'}, {'题目': '白城市有(  )个县（市、区）：', 'A': 'A.4  ', 'B': 'B.5  ', 'C': 'C.6', 'D': '', 'T': 'B'}, {'题目': '白城市医院是一所(  )级医院：', 'A': 'A.一   ', 'B': 'B.二  ', 'C': 'C.三', 'D': '', 'T': 'B'}, {'题目': '白城市国际电话区号是(  ):', 'A': 'A.+85 ', 'B': 'B.+86 ', 'C': 'C.+87', 'D': '', 'T': 'B'}, {'题目': '白城市国内电话区号是(  ):', 'A': 'A.0437 ', 'B': 'B.0436 ', 'C': 'C.0438', 'D': '', 'T': 'B'}, {'题目': '白城市长安机场距离市区(  )公里：', 'A': 'A.10公里 ', 'B': 'B.16.5公里 ', 'C': 'C.20公里', 'D': '', 'T': 'B'}, {'题目': '白城市实验小学位于  (  )   。', 'A': 'A.幸福大街 ', 'B': 'B. 青年大街', 'C': 'C. 长青东路', 'D': '', 'T': 'B'}, {'题目': '    (  )    是吉林省西部唯一的一所本科院校。', 'A': 'A.白城市卫生学院 ', 'B': 'B.白城市师范学院 ', 'C': 'C. 白城市幼师学院', 'D': '', 'T': 'B'}, {'题目': '途经华严寺的公交车是  (  )   ', 'A': 'A. 10路   ', 'B': 'B. 5路 ', 'C': 'C. 19路', 'D': '', 'T': 'B'}, {'题目': '白城商场位于  (  )   ', 'A': 'A. 新华路   ', 'B': 'B. 中兴路 ', 'C': 'C. 洮安路', 'D': '', 'T': 'B'}, {'题目': '白城市开发大厦位于  (  )   ', 'A': 'A. 金辉街   ', 'B': 'B. 幸福街 ', 'C': 'C. 长庆街', 'D': '', 'T': 'B'}, {'题目': '白城市铁路第二小学在  (  )   ', 'A': 'A. 胜利区附近   ', 'B': 'B. 南建设小区附近 ', 'C': 'C.百琦花园附近', 'D': '', 'T': 'B'}, {'题目': '白城市华严寺位于  (  )   ', 'A': 'A. 阳光广场附近  ', 'B': 'B. 森林公园附近 ', 'C': 'C.气象局附近 ', 'D': '', 'T': 'B'}, {'题目': '白城市洮北区养路段乘  (  )   路公交车', 'A': 'A. 2   ', 'B': 'B. 10   ', 'C': 'C.28', 'D': '', 'T': 'B'}, {'题目': '白城市师范学院是吉林省西部  (  )   ', 'A': 'A. 第二大的一所本科院校   ', 'B': 'B. 唯一一所本科院校 ', 'C': 'C. 第三大的本科院校', 'D': '', 'T': 'B'}, {'题目': '白城市中山幼儿园位于  (  )   ', 'A': 'A. 新华路   ', 'B': 'B. 新华街道金辉南街 ', 'C': 'C. 中兴东大路', 'D': '', 'T': 'B'}, {'题目': '白城市传染病医院是  (  )   ', 'A': 'A. 一级医院   ', 'B': 'B. 二级甲等医院 ', 'C': 'C. 三级甲等医院', 'D': '', 'T': 'B'}, {'题目': '白城市红叶小区位于  (  )   ', 'A': 'A. 洮安路   ', 'B': 'B. 新华路 ', 'C': 'C. 辽北路', 'D': '', 'T': 'B'}, {'题目': '白城第十中学位于 (  )  与内环交汇处。', 'A': 'A. 长庆南街', 'B': 'B.幸福东路 ', 'C': 'C. 海明西路', 'D': '', 'T': 'B'}, {'题目': '镇赉县位于吉林省西北部白城市的  (  )   。', 'A': 'A.北部', 'B': 'B.东北部', 'C': 'C.西南部', 'D': '', 'T': 'B'}, {'题目': '镇赉县有那些   (  )   能源.', 'A': 'A.风，太阳，燃气', 'B': 'B. 油气，风，太阳', 'C': 'C.太阳，燃气，原油', 'D': '', 'T': 'B'}, {'题目': '镇赉县境内有()流经。', 'A': 'A.三河', 'B': 'B. 一江三河', 'C': 'C.一江两河', 'D': '', 'T': 'B'}, {'题目': '镇赉县公交车81台，   (  )   条线路。', 'A': 'A.4    ', 'B': 'B.5   ', 'C': 'C.6', 'D': '', 'T': 'B'}, {'题目': '镇赉县主要景区有白沙滩灌区、哈尔淖风景区、  (  )  。', 'A': 'A. 月亮泡', 'B': 'B. 莫莫格自然保护区', 'C': 'C.向海自然保护区', 'D': '', 'T': 'B'}, {'题目': '镇赉县白鹤大酒店位于  (  )  1155号。', 'A': 'A.长青东路 ', 'B': 'B. 长青西路', 'C': 'C.长青北路', 'D': '', 'T': 'B'}, {'题目': '镇赉县位于吉林省西北部白城市的  (  )   。', 'A': 'A.北部', 'B': 'B.东北部', 'C': 'C.西南部', 'D': '', 'T': 'B'}, {'题目': '洮南市医院位于洮南市  (  )  。', 'A': 'A.建设路中段  ', 'B': 'B.育英东路  ', 'C': 'C.兴安南街西  ', 'D': 'D.光明北街', 'T': 'B'}, {'题目': '洮南市天恩地局位于洮南市 (  )。', 'A': 'A.兴隆西路  ', 'B': 'B. 兴隆路中段  ', 'C': 'C.团结西路', 'D': '', 'T': 'B'}, {'题目': '洮南市基督教会位于洮南市育英西路，洮南市清真寺位于洮南市 (  )  。', 'A': 'A.育英西路  ', 'B': 'B. 府城北街 ', 'C': 'C.团结西路', 'D': '', 'T': 'B'}, {'题目': '洮南地势呈东南向西北递增趋势，全市最低点为郭家店，海拔134.1米，最高点为 (  ) ，海拔662.5米。', 'A': 'A.蛟流河 ', 'B': 'B. 闹牛山 ', 'C': 'C. 郭家店泡子', 'D': '', 'T': 'B'}, {'题目': '(  ) 是洮南市行政代码。', 'A': 'A.0436    ', 'B': 'B.220881    ', 'C': 'C.137100', 'D': '', 'T': 'B'}, {'题目': '洮南客运站位于洮南市 (  ) 。', 'A': 'A.育英西路  ', 'B': 'B.通达路  ', 'C': 'C.广昌东路', 'D': '', 'T': 'B'}, {'题目': '洮南市锦湖湿地公园位于洮南市  (  )。', 'A': 'A.团结西路  ', 'B': 'B. 育英东路 ', 'C': 'C.光明南街', 'D': '', 'T': 'B'}, {'题目': '洮南市福麟宾馆位于洮南市 (  )。', 'A': 'A.富文西路  ', 'B': 'B. 建设东路 ', 'C': 'C.广昌西路 ', 'D': '', 'T': 'B'}, {'题目': '通榆县向海保护区是国家  (  ) A.级旅游景区，位于通榆县    乡。', 'A': 'A.4A.    ', 'B': 'B.5A.   ', 'C': 'C.   ', 'D': '', 'T': 'B'}, {'题目': '通榆县最大的风力发电场是 (  )  ', 'A': 'A.团结风电场     ', 'B': 'B.同发风电场', 'C': '', 'D': '', 'T': 'B'}, {'题目': '通榆县鹤乡一说来自  (  )  ', 'A': 'A.灰鹤   ', 'B': 'B.丹顶鹤 ', 'C': 'C. 白鹤', 'D': '', 'T': 'B'}, {'题目': '通榆县总幅员8496平方公里，位居吉林省第 (  ) 位', 'A': 'A.5位   ', 'B': 'B.7位   ', 'C': 'C.3位', 'D': '', 'T': 'B'}, {'题目': '通榆县公安局位于通榆县  (  ) ', 'A': 'A.风电路   ', 'B': 'B.经开区   ', 'C': 'C.育才路', 'D': '', 'T': 'B'}, {'题目': '大安市位于吉林省西北部，地处松嫩平原腹地，被称为“()”。', 'A': 'A.北方渔都   ', 'B': 'B. 北部明珠  ', 'C': 'C.嫩江明珠 ', 'D': '', 'T': 'B'}, {'题目': '2012年9月23日，中国垂钓协会授予吉林省大安市  (  )   称号.', 'A': 'A.中国垂钓之乡  ', 'B': 'B.中国休闲垂钓之乡  ', 'C': 'C.大安休闲垂钓之乡  ', 'D': '', 'T': 'B'}, {'题目': '汉书遗址位于  (  )    ，经考证，属青铜时期人类生活遗存，被誉为吉林省“露天博物馆”和“地下文物仓库”，是吉林省重点文物保护单位，中国东北三省典型青铜器时代文化的命名地. ', 'A': 'A. 太山镇   ', 'B': 'B. 月亮泡镇   ', 'C': 'C. 大岗子镇   ', 'D': '', 'T': 'B'}, {'题目': '五间房水库位于大安  (  ) 方位.', 'A': 'A. 东      ', 'B': 'B.西      ', 'C': 'C.  南   ', 'D': '', 'T': 'B'}, {'题目': '大安市第一人民医院紧邻（）', 'A': 'A.通达商店  ', 'B': 'B.春贾楼 ', 'C': 'C.古香古色中餐 ', 'D': '', 'T': 'B'}, {'题目': '大安市  (  )  街与大安世纪广场西侧相邻', 'A': 'A.大十街  ', 'B': 'B. 长白北街  ', 'C': 'C. 长白路 ', 'D': '', 'T': 'B'}, {'题目': '大安公安局位于  (  )   小区附近', 'A': 'A.平安新区', 'B': 'B. 平安家园 ', 'C': 'C. 平安花园', 'D': '', 'T': 'B'}, {'题目': '大安市市内公交线路（）条', 'A': 'A. 4     ', 'B': 'B. 7    ', 'C': 'C. 5    ', 'D': '', 'T': 'C'}, {'题目': '   (  )  不属于大安市文化遗产名录.', 'A': 'A.焦家烘炉    ', 'B': 'B.赵静剪纸    ', 'C': 'C.月亮泡渔文化', 'D': '', 'T': 'C'}, {'题目': '牛心套保以  (  )   闻名', 'A': 'A.  鱼     ', 'B': 'B.羊      ', 'C': 'C.螃蟹 ', 'D': '', 'T': 'C'}, {'题目': '大安市综合医院有  (  )   家', 'A': 'A. 2     ', 'B': 'B.3     ', 'C': 'C.4     ', 'D': '', 'T': 'C'}, {'题目': '南湖丽景在   (  )   与大赉南街交汇处', 'A': 'A. 幸福西路', 'B': 'B.长庆北街 ', 'C': 'C.南湖东路   ', 'D': '', 'T': 'C'}, {'题目': '大安第三人民医院位于   (  )   ', 'A': 'A. 江东西路 ', 'B': 'B.江东南路 ', 'C': 'C.江城东路 ', 'D': '', 'T': 'C'}, {'题目': '大安市的建材一条街位于   (  )   ', 'A': 'A.长虹西路', 'B': 'B. 康平南街', 'C': 'C.长虹东路', 'D': '', 'T': 'C'}, {'题目': '通榆县最大的人文景观是  (  )     ', 'A': 'A.北转盘   ', 'B': 'B.体育场   ', 'C': 'C.墨宝园', 'D': '', 'T': 'C'}, {'题目': '通榆县杏花景观位于  (  )    ', 'A': 'A.团街乡  ', 'B': 'B.包拉温都乡  ', 'C': 'C.包拉温都保护区', 'D': '', 'T': 'C'}, {'题目': '通榆县距离省会长春市  (  ) 公里', 'A': 'A.300公里   ', 'B': 'B.280公里  ', 'C': 'C.250公里', 'D': '', 'T': 'C'}, {'题目': '通榆县耕地面积为300万亩。平均每个农业人口占有耕12.21亩，人均居吉林省第 (  )位', 'A': 'A.2位   ', 'B': 'B.4位  ', 'C': 'C.1位', 'D': '', 'T': 'C'}, {'题目': '通榆县是吉林省最大的芦苇产区，其主要产区位于 (  ) ', 'A': 'A.向海蒙古族乡   ', 'B': 'B.团结乡  ', 'C': 'C.同发牧场', 'D': '', 'T': 'C'}, {'题目': '通榆县政府位于通榆县  (  ) ', 'A': 'A.新发东路   ', 'B': 'B.新发西路   ', 'C': 'C.民主路', 'D': '', 'T': 'C'}, {'题目': '通榆县出租汽车起步价格为 (  )元', 'A': 'A.2元   ', 'B': 'B.3元   ', 'C': 'C.5元', 'D': '', 'T': 'C'}, {'题目': '通榆县运输管理所位于通榆县 (  ) ', 'A': 'A.繁荣大街   ', 'B': 'B.长白大街  ', 'C': 'C.人民路', 'D': '', 'T': 'C'}, {'题目': '通榆县交警大队位于通榆县 (  )  ', 'A': 'A.人民路   ', 'B': 'B.育才路   ', 'C': 'C.长白路', 'D': '', 'T': 'C'}, {'题目': '通榆县是全省最大的 (  ) 产区', 'A': 'A.蓖麻   ', 'B': 'B.绿豆   ', 'C': 'C.葵花', 'D': '', 'T': 'C'}, {'题目': '通榆县初步探明储量5000万－1亿吨的中等油田位于 (  )   ', 'A': 'A.通榆县八面乡   ', 'B': 'B.通榆县鸿兴镇  ', 'C': 'C.通榆县鸿兴镇至八面乡', 'D': '', 'T': 'C'}, {'题目': '通榆县地理标志产品是  (  ) ', 'A': 'A.葵花   ', 'B': 'B.向海小米   ', 'C': 'C.草原', 'D': '', 'T': 'C'}, {'题目': '洮南市城乡总面积是5103平方公里，城区面积  (  )    。', 'A': 'A.5103平方米  ', 'B': 'B.5103平方公里  ', 'C': 'C.16.4平方公里', 'D': '', 'T': 'C'}, {'题目': ' (  ) 是洮南市邮政编码。', 'A': 'A.0436    ', 'B': 'B.220881    ', 'C': 'C.137100', 'D': '', 'T': 'C'}, {'题目': '洮南市火车站位于洮南市 (  ) 。', 'A': 'A.育英西路  ', 'B': 'B.通达南路  ', 'C': 'C.广昌东路', 'D': '', 'T': 'C'}, {'题目': '洮南市政务大厅（民生大厦）位于洮南市  (  )   。', 'A': 'A.团结西路  ', 'B': 'B.新发西路  ', 'C': 'C.新发东路', 'D': '', 'T': 'C'}, {'题目': '洮南市东邻(  )。', 'A': 'A.白城市  ', 'B': 'B.突泉县  ', 'C': 'C.大安市  ', 'D': 'D.通榆县', 'T': 'C'}, {'题目': '洮南市公安局位于洮南市 (  ) 。', 'A': 'A.光明南街 ', 'B': 'B.新发西路 ', 'C': 'C.新发东路', 'D': '', 'T': 'C'}, {'题目': '洮南市体育场位于洮南市 (  )。', 'A': 'A.团结西路  ', 'B': 'B. 育英东路 ', 'C': 'C.光明南街', 'D': '', 'T': 'C'}, {'题目': '洮南市金塔大酒店位于洮南市 (  )  。', 'A': 'A.富文西路  ', 'B': 'B. 建设东路 ', 'C': 'C.广昌西路', 'D': '', 'T': 'C'}, {'题目': '洮南市德安禅寺（老爷庙）位于洮南市 (  )。', 'A': 'A.兴隆西路  ', 'B': 'B. 兴隆路中段  ', 'C': 'C.团结西路', 'D': '', 'T': 'C'}, {'题目': '截止2012年镇赉县幅员面积  (  )   平方公里。', 'A': 'A.2110  ', 'B': 'B.3330  ', 'C': 'C.4737', 'D': '', 'T': 'C'}, {'题目': '镇赉县近   (  )   万人口 。', 'A': 'A.25万', 'B': 'B.36万', 'C': 'C.30万', 'D': '', 'T': 'C'}, {'题目': '镇赉县东南距长春机场  (  )  公里。', 'A': 'A.250   ', 'B': 'B.290   ', 'C': 'C.340', 'D': '', 'T': 'C'}, {'题目': '镇赉县莫莫格国家级自然保护区为国家  (  )   级景区、国家级自然保护区。', 'A': 'A.A.A.   ', 'B': 'B.A.A.A.   ', 'C': 'C.A.A.A.A.', 'D': '', 'T': 'C'}, {'题目': '镇赉县共有出租汽车  (  )   台。', 'A': 'A.677   ', 'B': 'B.688   ', 'C': 'C.699', 'D': '', 'T': 'C'}, {'题目': '镇赉县客运站位于站前街  (  )  。', 'A': 'A.279号 ', 'B': 'B.299号 ', 'C': 'C. 289号', 'D': '', 'T': 'C'}, {'题目': '镇赉客运站位于站前街   (  )   ', 'A': 'A. 287号   ', 'B': 'B. 288号 ', 'C': 'C. 289号', 'D': '', 'T': 'C'}, {'题目': '2010年11月，中国野生动物保护协会授予   (  )   “中国白鹤之乡”荣誉称号', 'A': 'A. 洮南市   ', 'B': 'B. 通榆县 ', 'C': 'C. 镇赉县', 'D': '', 'T': 'C'}, {'题目': '白城市去往长春的动车每天有多少班车次：（  ）', 'A': 'A.6  ', 'B': 'B.8  ', 'C': 'C.10', 'D': '', 'T': 'C'}, {'题目': '白城市车牌代码是（  ）：', 'A': 'A.吉A.  ', 'B': 'B.吉C.  ', 'C': 'C.吉G', 'D': '', 'T': 'C'}, {'题目': '凯伦大酒店位于(  )：', 'A': 'A.辽北路  ', 'B': 'B.中兴大路 ', 'C': 'C.胜利路', 'D': '', 'T': 'C'}, {'题目': '政务大厅位于(  )：', 'A': 'A.长庆东路 ', 'B': 'B.海明东路 ', 'C': 'C.公园东路', 'D': '', 'T': 'C'}, {'题目': '白城市有(  )家医院：', 'A': 'A.5  ', 'B': 'B.6  ', 'C': 'C.7', 'D': '', 'T': 'C'}, {'题目': '白城市政府位于(  )：', 'A': 'A.中兴大路 ', 'B': 'B.海明路  ', 'C': 'C.文化路', 'D': '', 'T': 'C'}, {'题目': '白城市汽车客运公司位于(  )：', 'A': 'A.辽北路  ', 'B': 'B.强大路  ', 'C': 'C.朝阳路', 'D': '', 'T': 'C'}, {'题目': '白城市位于吉林省  (  )  ，嫩江平原西部，科尔沁草原东部。', 'A': 'A. 西南部 ', 'B': 'B. 东北部', 'C': 'C. 西北部', 'D': '', 'T': 'C'}, {'题目': '白城市铁路第一小学位于  (  )   。', 'A': 'A.明仁东街 ', 'B': 'B. 明仁北街', 'C': 'C. 明仁南街', 'D': '', 'T': 'C'}, {'题目': '白城市欧亚购物中心位于开发大街和   (  )   交汇处。', 'A': 'A.幸福南街 ', 'B': 'B. 胜利北街', 'C': 'C. 胜利西路', 'D': '', 'T': 'C'}, {'题目': '白城市途经地区医院的公交车是   (  )   ', 'A': 'A. 10路   ', 'B': 'B. 19路 ', 'C': 'C. 1路', 'D': '', 'T': 'C'}, {'题目': '白城铁路第二中学位于   (  )   ', 'A': 'A. 瑞光街   ', 'B': 'B. 幸福街 ', 'C': 'C. 金辉街', 'D': '', 'T': 'C'}, {'题目': '洮北区政府位于   (  )   ', 'A': 'A. 金辉街  ', 'B': 'B. 长庆街 ', 'C': 'C.青年街', 'D': '', 'T': 'C'}, {'题目': '白城市新华加油站位于   (  )   路 ', 'A': 'A. 中兴路  ', 'B': 'B. 洮安路  ', 'C': 'C. 新华路', 'D': '', 'T': 'C'}, {'题目': '白城市旧物市场乘  (  )   路公交车', 'A': 'A.22   ', 'B': 'B. 10   ', 'C': 'C. 8', 'D': '', 'T': 'C'}, {'题目': '白城市波尔多小镇位于   (  )   街', 'A': 'A. 幸福街   ', 'B': 'B. 长庆街 ', 'C': 'C. 青年北大街', 'D': '', 'T': 'C'}, {'题目': '白城市师范学院位于   (  )   ', 'A': 'A. 新华路   ', 'B': 'B. 文化东路 ', 'C': 'C. 中兴西大路', 'D': '', 'T': 'C'}, {'题目': '白城市乘风二手车市场位于   (  )   ', 'A': 'A. 三合路   ', 'B': 'B. 中兴西大路 ', 'C': 'C. 曙光东路', 'D': '', 'T': 'C'}, {'题目': '白城市肛肠医院位于   (  )   ', 'A': 'A. 长庆街   ', 'B': 'B. 金辉街 ', 'C': 'C. 幸福街', 'D': '', 'T': 'C'}, {'题目': '白城十中位于   (  )   ', 'A': 'A. 洮安路   ', 'B': 'B. 新华路 ', 'C': 'C. 海明西路', 'D': '', 'T': 'C'}, {'题目': '洮南市妇产医院位于洮南市  (  )。', 'A': 'A.建设路中段  ', 'B': 'B.育英东路  ', 'C': 'C.兴安南街西  ', 'D': 'D.光明北街', 'T': 'D'}, {'题目': '洮南市第三人民医院位于洮南市  (  )。', 'A': 'A.建设路中段  ', 'B': 'B.育英东路  ', 'C': 'C.兴安南街西  ', 'D': 'D.永康西路', 'T': 'D'}]


#第二套判断题
pd_2=[{'题目': '白城机场位于白城市洮北区洮河镇刁家屯境内。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市位于吉林省西北部，嫩江平原西部，科尔沁草原东部。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '素有“草原明珠”之称的月亮泡位于大安市境内。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市实验小学位于青年大街。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市铁路第一小学位于明仁南街。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市欧亚购物中心位于开发大街和胜利西路交汇处。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市区有5家车队。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市被称为“八景之一”的风景区是向海自然保护区。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市有8个少数民族乡。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市有2个国家级自然保护区。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城第十中学位于海明西路与内环交汇处。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市车牌代码是吉G。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市宾馆位于爱国街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市有5个县（市、区）', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市有4个开发区', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '政务大厅位于公园东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市公交车有22条线路在进行道路经营', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市位于吉林省西北部', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市医院是一所二级医院', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市有5所中学', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市国际电话区号是 +86', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市四中位于白平公路38号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市汽车客运公司位于朝阳路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市汽车客运站位于辽北路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市长安机场距离市区16.5公里', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城十中位于海明西路与内环交汇处', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市三中位于电业局北200道西', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市中医院位于青年街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市铁路第二小学在胜利区附近', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市华严寺位于森林公园附近', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城铁路第二中学位于金辉街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市去往长春的动车每天有10个车次', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城铁路医院位于明仁南街258号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市农科院位于三合路17号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市靖安小学位于洮安东路77号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市公安局车辆管理所位于洮北区101乡道北50米', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市第二幼儿园位于文化东路68-1', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市中山幼儿园位于新华街道金辉南街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市胜利吉府宾馆位于纯阳路28号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市肛肠医院位于幸福大街76-10号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市乘风二手车市场位于曙光东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市城南办事处位于洮北区长庆南街与胜利东路交汇处道南', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市传染病医院位于三合路227号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市气象局位于三合路立新胡同10-3号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市波尔多小镇位于青年北大街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市一中位于新华路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市开发大厦位于幸福街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '白城市总面积为2.8万平方公里。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '向海国家AAAAA级景区是国家级自然保护区。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城风力发电场位于到保。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市烟草小区位于文化东路。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市区有12家银行。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '素有“草原明珠”之称的月亮泡自然保护区位于嫩江和二龙涛河交汇处。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市丽景庄园位于市民广场西侧。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '途经白城市阳光广场的是6路公交车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '途经白城市华严寺的是15路公交车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市师范学院是吉林省西部第二大的一所本科院校。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市长安机场距离市区20公里。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市华兴家园小区位于市民广场南侧。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市总人口大约400万人。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '途经市民广场的是19路公交车。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '途经西师范学院的公交车是6路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市凯伦大酒店位于中兴大路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市火车站位于朝阳路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市政府位于中兴大路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市洮北区的邮政编码是137100', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市出租车在2.5公里路程之内的运价是3元', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市有6家医院', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市国内电话区号是0437', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市新城区位于幸福南大街以西', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '四季华城位于阳光广场东侧', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市畜牧业学校位于朝阳路171号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '牛心套以羊闻名', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市金鹿电影城位于洮安东路63号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市铁鹤小区位于长庆小学西100米', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市医院位于中兴西大路111号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市兵器城家园位于纯阳路北100米', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '全民健身中心位于大安市东部', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市有3个国家级自然保护区', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市师范学院位于文化东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市传染病医院是三级甲等医院', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城商场位于洮安路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城实验高中位于幸福街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮北区政府位于长庆街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市出租车1825台', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '白城市医院位于三合路227号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县主要景区有白沙滩国家级灌区、哈尔淖风景区、莫莫格国家级自然保护区。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县白鹤大酒店位于长青西路1155号。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县客运站位于站前街289号。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县南湖生态园位于县城南端，占地面积145万平方米，建设工期为5年。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '截止2012年镇赉县幅员面积4737平方公里', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县近30万人口 ', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县有那些油气，风，太阳能源', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县共有出租汽车677台', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '镇赉县公交车81台，5条线路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '2010年11月，中国野生动物保护协会授予镇赉县( 中国白鹤之乡"荣誉称号。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '1947年8月，镇东与镇南两县合并为镇赉县', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县政府位于庆余南街与永安西路交汇西侧', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县辖乡镇11个，其中镇7个，乡3个. ', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县境内有 一江两河流经', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县共56个少数民族', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': ' 镇赉县东南距长春机场250公里', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县莫莫格国家级自然保护区为国家AAA级景区、国家级自然保护区', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '镇赉县位于吉林省西北部白城市的西南部', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '通榆县向海保护区是国家5A级旅游景区，位于通榆县开通镇乡', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '通榆县最大的人文景观是墨宝园', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '月亮泡渔文化不属于大安市文化遗产名录', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '通榆县最大的风力发电场是团结风电场', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '通榆县杏花景观位于团街乡', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市位于吉林省西北部', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市城乡总面积是5103，城区面积16.4平方公里', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市的城乡总人口44万人，城镇人口13.8万人', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '137100是洮南市邮政编码', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '0436是洮南区号', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '220881是洮南市行政代码', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南客运站位于洮南市通达路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市政府位于洮南市新发东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市辖6个街道办事处', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市共18个乡镇', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市医院位于洮南市育英东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市中医院位于洮南市建设路中段', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '精神病医院位于洮南市兴安南街西', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市妇产医院位于洮南市光明北街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市公安局位于洮南市新发东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市法院位于洮南市新发西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市检察院位于洮南市光明南街 ', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市吴俊升官邸（大帅府）位于洮南市兴隆西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市体育场位于洮南市光明南街', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市金塔大酒店位于洮南市广昌西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南地势呈东南向西北递增趋势，全市最低点为郭家店，海拔134.1米，最高点为郭家店泡子，海拔662.5米。', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '洮南市卫生防疫站位于洮南市广昌东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市德安禅寺（老爷庙）位于洮南市兴隆路中段', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市基督教会位于洮南市育英西路，洮南市清真寺位于洮南市育英西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市天恩地局位于洮南市团结西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市火车站位于洮南市育英西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市政务大厅（民生大厦）位于洮南市新发西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市锦湖湿地公园位于洮南市团结西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市西郊公园位于洮南市育英东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市福麟宾馆位于洮南市富文西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '洮南市聚香大酒店位于洮南市建设东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '大安第三人民医院位于江城东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '大安市最大的购物超市繁华超市位于嫩江北街上', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '大安第三人民医院位于江城东路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '大安市第一人民医院紧邻春贾楼', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '大安市长白北街与大安世纪广场西侧相邻', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'A'}, {'题目': '大安市的建材一条街位于长虹西路', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '大安市内的初中一共有5个', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '大安公安局位于平安花园小区附近', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '大安市综合医院有3家', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}, {'题目': '经过大安市的国道有301国道', 'A': '正确', 'B': '错误', 'C': '', 'D': '', 'T': 'B'}]


#第二套题库中的题目
data_2_list=choice_2+pd_2




#分别从第一套和第二套中 各随机选取50道题
random_list_all=random.sample(data_1_list,50)+random.sample(data_2_list,50)#前面50道选择题，后面50道判断题

random_list_get=random.sample(random_list_all,100)

num=1
random_list=[]

for i in random_list_get:
    i['题目']= str(num)+'.'+i['题目']
    num+=1
    random_list.append(i)


# print(random_list)
# print(len(random_list))
# print(random_list[-1])

#错题列表
false_list=[]



sum=0 #总分数，即答对的题目。

flag = 0

i=0

a= None



class Read_excel:
    def __init__(self):
        self.data = {}
        # self.df = pd.read_excel('./data.xlsx', sheet_name=0)
        # print(self.df)

    def get(self):
        global i
        try:
            data = random_list[i]
            i += 1
            print(data.keys())
            return data
        except:
            # tk.messagebox.showinfo('提示', "这是最后一道题啦！！")
            tk.messagebox.showinfo('总分','答题结束\n您的总分为：'+str(sum))
            # global a
            # a = tkinter.messagebox.askokcancel('提示', '是否查看错题？')
            # if a:
            #     initface(root).change()
            #     # face1(root)




r = Read_excel()

hint = ''


class basedesk():
    def __init__(self, master):
        self.root = master
        self.root.config()
        # 设置标题
        self.root.title('答题系统')

        # 设置窗口大小
        self.width = 900
        self.height = 700
        # 获取屏幕尺寸以计算布局参数，使窗口居屏幕中央
        self.screenwidth = root.winfo_screenwidth()
        self.screenheight = root.winfo_screenheight()
        alignstr = '%dx%d+%d+%d' % (
        self.width, self.height, (self.screenwidth - self.width) / 2, (self.screenheight - self.height) / 2)
        self.root.geometry(alignstr)
        # 大小不可变，更改为True则可变
        self.root.resizable(width=True, height=True)
        initface(self.root).run()

"""
模拟考试界面：
"""
class initface():
    def __init__(self, master):
        self.master = master
        # self.master.config(bg='green')
        # 基准界面initface
        self.initface = tk.Frame(self.master, )
        self.initface.pack()
        btn = tk.Button(self.initface, text='查看我的错题', command=self.change)
        btn.pack()

        self.img = None
        self.var = tk.StringVar()
        self.sum = tk.StringVar()
        self.timeLabel = Label(self.initface, textvariable=self.var, font=('黑体', 15), fg='blue')
        self.timeLabel.pack()
        self.sumLabel = Label(self.initface, textvariable=self.sum, font=('黑体', 15), fg='blue')
        self.sumLabel.pack()
        self.sum.set('共100道题-当前答对题数: 0')

        """
        计时相关代码
        """

        self.s = None
        self.zt = None
        self.count = 0
        self.flag = 0  # 计时控制，防止重复计时

        def stop():
            self.flag = 0
            self.initface.after_cancel(self.s)
            # self.zt = self.var
            # 获取系统时间
            self.star = time.time()

        def gettime():
            self.flag = 1
            self.count += 1
            minutes = int(self.count / 60)
            seconds = int(self.count - minutes * 60.0)
            self.var.set('计时器：' + '%02d:%02d' % (minutes, seconds))
            self.s = self.initface.after(1000, gettime)

        def starttime():
            if self.flag == 1:
                pass
            else:
                gettime()

        gettime()
        self.timeButton = tk.Button(self.initface, text='暂停计时', font=('黑体', 15), command=stop)
        self.timeButton.pack()
        self.startButton = tk.Button(self.initface, text='开始计时', font=('黑体', 15), command=starttime)
        self.startButton.pack()

        """
        计时相关代码
        """

        # 获取数据
        self.data = r.get()

        if len(self.data.keys()) == 6:
            self.text_topic = tk.StringVar()
            self.text_topic.set(self.data['题目'])
            self.text_A = tk.StringVar()
            self.text_A.set(self.data['A'])
            self.text_B = tk.StringVar()
            self.text_B.set(self.data['B'])
            self.text_C = tk.StringVar()
            self.text_C.set(self.data['C'])
            self.text_D = tk.StringVar()
            self.text_D.set(self.data['D'])
        if len(self.data.keys()) == 5:
            self.text_topic = tk.StringVar()
            self.text_topic.set(self.data['题目'])
            self.text_A = tk.StringVar()
            self.text_A.set(self.data['A'])
            self.text_B = tk.StringVar()
            self.text_B.set(self.data['B'])
            self.text_C = tk.StringVar()
            self.text_C.set(self.data['C'])
        if len(self.data.keys()) == 4:
            self.text_topic = tk.StringVar()
            self.text_topic.set(self.data['题目'])
            self.text_A = tk.StringVar()
            self.text_A.set(self.data['A'])
            self.text_B = tk.StringVar()
            self.text_B.set(self.data['B'])

    def begin(self):
        # print('*' * 50)
        # print('下一题：1111')
        self.data = r.get()
        if self.data != None:
            if len(self.data.keys()) == 6:
                # self.text_topic = tk.StringVar()
                self.text_topic.set(self.data['题目'])
                # self.text_A = tk.StringVar()
                self.text_A.set(self.data['A'])
                # self.text_B = tk.StringVar()
                self.text_B.set(self.data['B'])

                self.text_C.set(self.data['C'])
                self.text_D.set(self.data['D'])

                self.canvas.delete(self.hint)
                self.canvas.delete(self.next)

                b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_A)
                b1.pack()
                self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

                b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_B)
                b2.pack()
                self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)

                b3 = tk.Button(self.initface, textvariable=self.text_C, font=("宋体", 10), image=self.img, bd=1, width=15,
                               height=20,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_C)
                b3.pack()
                self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

                b4 = tk.Button(self.initface, textvariable=self.text_D, font=("宋体", 10), image=self.img, bd=1, width=15,
                               height=20,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_D)
                b4.pack()
                self.cb4 = self.canvas.create_window(790, 300, width=180, height=100, window=b4)
            if len(self.data.keys()) == 5:
                # self.text_topic = tk.StringVar()
                self.text_topic.set(self.data['题目'])
                # self.text_A = tk.StringVar()
                self.text_A.set(self.data['A'])
                # self.text_B = tk.StringVar()
                self.text_B.set(self.data['B'])

                self.text_C.set(self.data['C'])
                self.canvas.delete(self.hint)
                self.canvas.delete(self.next)

                b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_A)
                b1.pack()
                self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

                b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_B)
                b2.pack()
                self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)

                b3 = tk.Button(self.initface, textvariable=self.text_C, font=("宋体", 10), image=self.img, bd=1, width=15,
                               height=20,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_C)
                b3.pack()
                self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

            if len(self.data.keys()) == 4:
                # self.text_topic = tk.StringVar()
                self.text_topic.set(self.data['题目'])
                # self.text_A = tk.StringVar()
                self.text_A.set(self.data['A'])
                # self.text_B = tk.StringVar()
                self.text_B.set(self.data['B'])

                self.canvas.delete(self.hint)
                self.canvas.delete(self.next)

                b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_A)
                b1.pack()
                self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

                b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), image=self.img, bd=1, width=20,
                               height=50,
                               compound="center", wraplength=200, fg='#000',
                               command=self.verify_B)
                b2.pack()
                self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)

    def run(self):

        self.canvas = tk.Canvas(self.initface, width=1100, height=600, bd=0, highlightthickness=0)
        # imgpath = './ABC.png'
        # img = Image.open(imgpath)
        # photo = ImageTk.PhotoImage(img)
        # 设置窗口大小
        self.width = 1200
        self.height = 600
        self.canvas.create_image(self.width / 2, self.height / 2)
        self.canvas.pack()

        topic = Label(self.initface, textvariable=self.text_topic, font=("华文行楷", 20), wraplength=500, width=500, height=120,
                      anchor="w",
                      justify=tk.CENTER)
        topic.pack()
        self.canvas.create_window(450, 100, width=500, height=120, window=topic)

        if len(self.data.keys()) == 6:
            # photo2 = tk.PhotoImage(file='./ABCD.png')
            b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_A)
            b1.pack()
            self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

            b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_B)
            b2.pack()
            self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)
            b3 = tk.Button(self.initface, textvariable=self.text_C, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_C)
            b3.pack()
            self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

            b4 = tk.Button(self.initface, textvariable=self.text_D, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_D)
            b4.pack()
            self.cb4 = self.canvas.create_window(790, 300, width=180, height=100, window=b4)
        if len(self.data.keys()) == 5:
            # photo2 = tk.PhotoImage(file='./ABCD.png')
            b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_A)
            b1.pack()
            self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

            b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_B)
            b2.pack()
            self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)
            b3 = tk.Button(self.initface, textvariable=self.text_C, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_C)
            b3.pack()
            self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

        if len(self.data.keys()) == 4:
            # photo2 = tk.PhotoImage(file='./ABCD.png')
            b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_A)
            b1.pack()
            self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

            b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                           compound="center", wraplength=200,
                           command=self.verify_B)
            b2.pack()
            self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)
        self.initface.mainloop()
    def verify_create(self):
        if len(self.data.keys()) == 6:
            self.canvas.delete(self.cb1)
            self.canvas.delete(self.cb2)
            self.canvas.delete(self.cb3)
            self.canvas.delete(self.cb4)
            # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
            b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                           compound="center",
                           command=self.begin)
            self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
        if len(self.data.keys()) == 5:
            self.canvas.delete(self.cb1)
            self.canvas.delete(self.cb2)
            self.canvas.delete(self.cb3)
            # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
            b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                           compound="center",
                           command=self.begin)
            self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
        if len(self.data.keys()) == 4:
            self.canvas.delete(self.cb1)
            self.canvas.delete(self.cb2)
            # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
            b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                           compound="center",
                           command=self.begin)
            self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
    def verify_A(self):
        # print('你的A')
        if self.data['T'] == 'A':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            global sum
            sum+=1
            self.sum.set('共100道题-当前答对题数 '+str(sum))
            if len(self.data.keys())==6:
                self.canvas.delete(self.cb1)
                self.canvas.delete(self.cb2)
                self.canvas.delete(self.cb3)
                self.canvas.delete(self.cb4)
                # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
                b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                               compound="center",
                               command=self.begin)
                self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
            if len(self.data.keys())==5:
                self.canvas.delete(self.cb1)
                self.canvas.delete(self.cb2)
                self.canvas.delete(self.cb3)
                # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
                b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                               compound="center",
                               command=self.begin)
                self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
            if len(self.data.keys())==4:
                self.canvas.delete(self.cb1)
                self.canvas.delete(self.cb2)
                # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
                b5 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                               compound="center",
                               command=self.begin)
                self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            false_list.append(self.data)
            self.verify_create()

    def verify_B(self):
        # print('你的B')
        if self.data['T'] == 'B':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            global sum
            sum += 1
            self.sum.set('共100道题-当前答对题数 '+str(sum))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']]   # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            false_list.append(self.data)
            self.verify_create()

    def verify_C(self):
        # print('你的B')
        if self.data['T'] == 'C':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            global sum
            sum += 1
            self.sum.set('共100道题-当前答对题数 '+str(sum))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']]   # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            false_list.append(self.data)
            self.verify_create()

    def verify_D(self):
        # print('你的B')
        if self.data['T'] == 'D':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            global sum
            sum += 1
            self.sum.set('共100道题-当前答对题数 '+str(sum))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']]   # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            false_list.append(self.data)
            self.verify_create()

    def change(self, ):
        self.initface.destroy()
        face1(self.master)

"""
错题集查看
"""

class face1():
    def __init__(self, master):
        self.master = master
        # self.master.config(bg='blue')
        self.face1 = tk.Frame(self.master, )
        self.face1.pack()
        labeltip=tk.Label(self.face1,text='选中要查看的错题，点击查看，查看正确答案。',fg='red',font=('宋体',15))
        labeltip.pack()

        btn_back = tk.Button(self.face1, text='返回继续考试', command=self.back)
        btn_back.pack()

        def look():
            index=self.lb.index('active')
            print(index)
            tk.messagebox.showinfo('题目','正确答案为：\n'+false_list[index][false_list[index]['T']])
        theButton = tk.Button(self.face1, text="查看", command=look)
        theButton.pack()

        """
        滚动条
        """
        # 初始化滚动条，放到右边
        self.sb = tk.Scrollbar(self.face1)
        self.sb.pack(side=tk.LEFT, fill=tk.Y)
        self.hx = tk.Scrollbar(self.face1)
        self.hx.pack(side=tk.BOTTOM, fill=tk.X)
        # 初始化选项列表，放到左边
        self.lb = tk.Listbox(self.face1, width=600,yscrollcommand=self.sb.set,xscrollcommand=self.hx.set,selectmode='SINGLE',height=50,font=('宋体',15))
        for i in false_list:
            self.lb.insert(tk.END, i['题目'] +'   ' +i['A']+ ' '+i['B']+ ' '+i['C']+' '+i['D'])
            # self.lb.insert(tk.END, i['题目'] +"\n正确答案为:"+i[i['T']])
        self.lb.pack(side=tk.LEFT, fill=tk.BOTH)
        # 关联滚动条
        self.sb.config(command=self.lb.yview)
        # self.sb.config(command=self.lb.xview)
        # 关联滚动条
        # self.hx.config(command=self.lb.yview)
        self.hx.config(command=self.lb.xview)


        # def look():
        #     index=self.lb.index('active')
        #     print(index)
        #     tk.messagebox.showinfo('题目','正确答案为：\n'+false_list[index][false_list[index]['T']])

        # theButton = tk.Button(self.face1, text="查看", command=look)
        # theButton.pack()
        """
        滚动条
        """


    def back(self):
        self.face1.destroy()
        initface(self.master).run()
        # basedesk()

if __name__ == '__main__':
    root = tk.Tk()
    basedesk(root)
    root.mainloop()