# coding:utf-8
import tkinter as tk
from tkinter import Label



# Tk

datapd_list=[{'题目': '1、出租汽车驾驶员从业资格包括巡游出租汽车驾驶员从业资格和网络预约出租汽车驾驶员从业资格等', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '2、申请人若首次参加出租汽车驾驶员从业资格考试，其全国公共科目和区域科目考试可在不同的区域完成', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '3、投入运营的出租汽车车辆应当安装具有行驶记录功能的车辆卫星定位装置、应急报警装置', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '4、根据国家关于深化出租汽车改革的要求，严禁出租汽车企业向驾驶员收取高额抵押金，现有抵押金过高的要降低', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '5、新增巡游出租汽车经营权全部实行无偿使用，但可以变更经营主体', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '6、出租汽车综合服务区应当为进入服务区的出租汽车驾驶员免费提供餐饮、修理等服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '7、城市人民政府要优先发展公共交通，适度发展出租汽车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '8、巡游出租汽车和网络预约出租汽车应实行错位发展和差异化经营，为社会公众提供品质化、多样化的运输服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '9、取得从业资格证的出租汽车驾驶员，应当经出租汽车行政主管部门从业资格注册后，方可从事出租汽车客运服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '10、网络预约出租汽车驾驶员的注册，通过出租汽车经营者向发证机关所在地出租汽车行政主管部门报备完成', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '11、个体出租汽车经营者自己驾驶出租汽车从事经营活动的，不需要申请办理从业资格注册手续', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '12、出租汽车驾驶员应到其所属的出租汽车企业完成注册', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '13、出租汽车驾驶员在从业资格注册有效期内，与出租车经营者解除劳动合同的，应当申请注销从业资格证', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '14、出租汽车驾驶员取得从业资格证后超过1年未申请注册的，注册后上岗前应当完成不少于27学时的继续教育', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '15、出租汽车驾驶员继续教育由出租汽车经营者组织实施', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '16、出租汽车驾驶员办理注册后应将从业资格证交由出租汽车经营者保管', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '17、网约车按照高品质服务、差异化经营的原则，有序发展', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '18、网约车平台公司承担承运人责任，应当保证运营安全，保障乘客合法权益', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '19、网约车平台公司暂停或者终止运营的，应当通告提供服务的车辆所有人和驾驶员', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '20、网约车平台公司应与驾驶员签订劳动合同或者协议，明确双方的权利和义务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '21、网约车平台公司在提供网约车服务时，应当提供驾驶员姓名、照片、手机号码和服务评价结果，以及车辆牌照等信息', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '22、网约车平台公司不得妨碍市场公平竞争，不得为排挤竞争对手而以低于成本的价格运营扰乱正常市场秩序', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '23、网约车驾驶员应当为乘客购买承运人责任险', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '24、网约车平台公司和驾驶员可以向第三方有偿提供驾驶员、约车人和乘客的相关个人信息', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '25、任何企业和个人不得向未取得合法资质的车辆、驾驶员提供信息对接开展网约车经营服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '26、任何企业和个人不得以私人小客车合乘名义提供网约车经营服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '27、网约车车辆和驾驶员不得通过未取得经营许可的网络服务平台提供运营服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '28、网约车只要行驶里程未达到60万千米，就可以允许经营', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '29、使用年限达到8年但行驶里程未达到60万千米的网约车，应当退出经营', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '30、小、微型非营运载客汽车登记为预约出租客运的，行驶里程达到60万千米时强制报废', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '31、除小、微型非营运载客汽车外，其他小、微型营运载客汽车登记为预约出租客运的，按照该类型营运载客汽车报废标准和网约车报废标准中先行达到的标准报废', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '32、国家鼓励巡游出租汽车实行规模化、集约化、个体化经营', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '33、出租汽车驾驶员应当做好运营前例行检查，保持车辆设施、设备完好，车容整洁', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '34、出租汽车驾驶员应当衣着整洁，语言文明，主动问候，提醒乘客根据意愿选择是否系安全带', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '35、出租汽车驾驶员应当根据乘客意愿升降车窗玻璃及使用空调、音响、视频等服务设备', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '36、为提高车辆使用效率，出租汽车驾驶员在客流高峰时段，可以不经乘客同意搭载其他乘客', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '37、出租汽车驾驶员应当遵守道路交通安全法规，文明礼让行车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '38、出租汽车驾驶员发现乘客遗失财物，设法及时归还失主', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '39、乘客要求去偏远、冷僻地区或者夜间要求驶出城区的，出租汽车驾驶员有权直接拒绝提供服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '40、出租汽车驾驶员发现乘客遗留可疑危险物品的，应当立即报警', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '41、出租汽车驾驶员接单后，应当按照约定时间到达约定地点', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '42、驾驶员有私自转包经营等违法行为的，巡游出租汽车经营者应当予以纠正；情节严重的，可按照约定解除合同', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '43、巡游出租汽车经营者应当通过建立替班驾驶员队伍、减免驾驶员休息日经营承包费用等方式保障出租汽车驾驶员休息权', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '44、巡游出租汽车经营者应当合理确定承包、管理费用，可以适当向驾驶员转嫁投资和经营风险', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '45、巡游出租汽车经营者应当根据经营成本、运价变化等因素及时调整承包费标准或者定额任务等', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '46、国家鼓励、支持和引导出租汽车企业、行业协会与出租汽车驾驶员、工会组织平等协商，合理确定并动态调整出租汽车承包费标准或定额任务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '47、有交通肇事犯罪记录的出租汽车驾驶员，将由发证机关撤销其从业资格证，并公告作废', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '48、出租车驾驶员不再具备从业条件的，出租汽车行政主管部门将依据相关法律法规撤销或者吊销其从业资格证件', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '49、转借、出租、涂改从业资格证的，由县级以上出租汽车行政主管部门责令改正，并处1万元以上3万元以下的罚款', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '50、出租汽车是城市公共交通的组成部分', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '51、新增和更新出租汽车，应当使用新能源汽车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '52、巡游出租汽车驾驶员如无法继续从事经营的，可以将承包经管权转包给其他驾驶员', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '53、新增出租汽车经营权一律实行期限制，不得再实行无期限制', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '54、取得从业资格证件但在考核周期内未注册在岗的，仍需参加出租汽车驾驶员服务质信誉考核', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '55、出租汽车驾驶员服务质量信誉考核工作每年进行一次', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '56、出租汽车驾驶员一个考核周期届满，经签注服务质量信誉考核等级后，该考核周期内的扣分与加分予以清除，不转人下一个考核周期', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '57、出租汽车驾驶员违反服务质量信誉考核指标的，一次扣分分值分别为1分、3分、5分、10分、20分共5种', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '58、出租汽车驾驶员可以在不增加行驶里程的情况下，另载他人，无需征得乘客同意', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '59、出租汽车驾驶员可以将对自已服务不满意的乘客转给其他出租汽车或中止服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '60、车辆起步前，出租汽车驾驶员应检查车门是否关好', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '61、乘客到达目的地后，在不影响通路交通和行人安全的情况下，应在允许停车路段按乘客的要求就近停车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '62、当乘客在禁停路段扬手招车时，为了减少不必要的投诉，驾驶员应停车载客', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '63、载客过程中如因客观原因确需绕道时，出租汽车驾驶员应主动向乘客说明情况，如乘客不同意绕行要求下车时，可以拒绝乘客下车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '64、出租汽车驾驶员发现乘客遗失物应该及时归还或者上交', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '65、出租汽车驾驶员发现乘客遗留物品，若找不到失主，可自行处理', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '66、出租汽车驾驶员载客途中无正当理由中断服务的视为中途甩客', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '67、出租汽车运营过程中，乘客要求使用空调、音响等设备时，驾驶员可以婉言拒绝', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '68、为提供良好服务，出租汽车驾驶员只要看到乘客扬手招车，必须马上停车载客', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '69、如果乘客要求下车的路段禁止停车，出租汽车驾驶员应婉拒并耐心向乘客解释，至可下车地点停车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '70、外地乘客乘坐出租汽车时询问驾驶员当地的风景名胜等与目的地无关的地方，驾驶员可以不予理睬', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '71、出租汽车驾驶员运营过程中不得向来客推销购物、饮食和休闲娱乐等项目', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '72、出租汽车驾驶员在运营过程中，征得乘客同意后可以在车内吸烟', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '73、出租汽车驾驶员小王接班后发现自己一点零钱也没有准备，但赚钱时间要紧，先开上路，让乘客支付零钱就可以了', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '74、出租汽车驾驶员进入服务站点后可以插队，以提高运营效率', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '75、出租汽车驾驶员在交班途中，可以询问乘客目的地是否与自已交班同方向，以确定是否载客，不耽误交班', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '76、乘客上下出租汽车时，驾驶员应引导乘客由右侧上下车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '77、乘客上出租汽车时，驾驶员应主动协助乘客提拿行李，乘客应主动关闭行李舱', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '78、为保证行车安全，出租汽车驾驶员应提醒并在必要时协助乘客系好安全带', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '79、出租汽车驾驶员出车前应检查车容车貌、车辆技术状况、燃油或燃气，并备好随车设施、工具', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '80、出租汽车驾驶员因特殊情况不能完成栽客服务的一律视为拒载或甩客', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '81、网络预约出租汽车可以在巡游出租汽车营运站点候客', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '82、无论经营者采取派单机制还是抢单机制，网络预约出租汽车驾驶员收到订单信息后，必须接单', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '83、出租汽车驾驶员接单后，未到达约定上车地点时，不应提前确认车辆已到达', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '84、出租汽车驾驶员接单后，若去往乘客目地的路况不好，可以要求乘客取消订单', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '85、向网络服务平台发送预约用车请求的人，必须是乘客本人', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '86、出租汽车驾驶员接单后，按约定时间到达上车地点，即可向经营者发送乘客上车确认信息', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '87、出租汽车驾驶员应随身携带从业资格证', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '88、出租汽车驾驶员接单后，应等待乘客联系自己，确认上车时间及地点', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '89、出租汽车车辆标志全国统一', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '90、出租汽车驾驶员接单后，乘客上车后目的地发生变化的，费用按实际行程收取', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '91、网络预约出租汽车驾驶员待乘客上车后，可提示乘客使用客户端应用程序中的车辆位置信息实时分享功能', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '92、未经约车人或乘客同意，网络预约出租汽车驾驶员未按承诺到达约定上车地点提供服务的行为视为拒载', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '93、巡游出租汽车驾驶员收听到乘客电召服务需求信息后，必须提供相应服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '94、乘客下车时，出租汽车驾驶员可以向乘客索取小费', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '95、出租汽车驾驶员因修路等客观原因确需绕道的，可以不用向乘客说明以避免纠纷', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '96、出租汽车车辆，使用达5年的强制报废', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '97、无障碍出租汽车不用设置专用标志', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '98、出租汽车车况良好，可由出租汽车企业向主管部门申请免去年检，直接领取年检合格证', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '99、出租汽车驾驶员在运营过程中应根据乘客的要求使用空调、音响等设备，不得无故拒绝', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '100、出租汽车办理有效的机动车号牌和行驶证后，即符合运营资质', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '101、出租汽车应配备合格的消防器材，并按要求定期检查', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '102、出租汽车车辆内外可根据商家要求张贴商业广告', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '103、无障碍出租汽车应保证充足空间安放轮椅', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '104、出租汽车车辆号牌应当清晰，固定端正，无遮挡物、反光物', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '105、出租汽车车厢内应整洁、卫生，无杂物、异味', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '106、出租汽车行李厢内可供乘客放置行李物品的空间不得少于行李厢的三分之一', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '107、出租汽车应保持车门功能正常，车窗玻璃封闭良好，洁净明亮，无遮蔽物，升降自如', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '108、出租汽车应当仪表完好、整洁，仪表台不得放置与运营无关的物品', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '109、出租汽车遮阳板、化妆镜、顶棚应齐全完好洁净', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '110、出租汽车安全带和锁扣应齐全、有效、无污渍', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '111、遇有流行传染病时，出租汽车要做好有针对性的消毒工作', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '112、出租汽车车身内外应清洁完好，漆皮完整无损，可按自己的爱好做个性化装饰', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '113、出租汽车座椅应牢固无塌陷，前排座椅可前后移动，倾度可调', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '114、小李驾驶的出租汽车雨刮器坏了，考虑到正值少雨季节，他可以不必立即送修，以免耽误运营', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '115、无障碍出租汽车是指由残疾人驾驶的出租汽车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '116、出租汽车驾驶员在运营过程中应做到端庄大方，举止文明', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '117、夏天天气炎热，出租汽车驾驶员在运营过程中可以穿背心，短裤', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '118、女性出租汽车驾驶员上岗时浓妆是塑造美好形象、尊重乘客的表现', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '119、男性出租汽车驾驶员发型要求整齐大方，不留怪异的发型', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '120、出租汽车驾驶员不得在车厢内吸烟、饮食', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '121、夏天天气炎热，多下雨，出租汽车驾驶员可以穿拖鞋运营', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '122、出租汽车驾驶员要给乘客以亲切感和信任感，则需注意自身形象，着装规范，仪容大方', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '123、出租汽车驾驶员在运营过程中提倡使用普通话', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '124、出租汽车驾驶员驾驶车辆时不能吸烟，但是可以接打电话', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '125、出租汽车驾驶员与乘客交流要频繁不间断，内容文明健康', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '126、出租汽车驾驶员应虚心接受乘客的批评意见，处理好与乘客的纠纷', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '127、出租汽车驾教员不应有在乘客面前挖鼻、剔牙、搔头等行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '128、出租汽车驾驶员在运营服务时不得有向车外抛物、吐痰等行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '129、张师傅不会讲普通话，所以不能参加出租汽车运营服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '130、出租汽车驾驶员运营期间应按规定着装', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '131、出租汽车驾驶员在乘客上车时要与乘客有眼神接触', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '132、出租汽车驾驶员在乘客表达不满时不应粗暴打断', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '133、出租汽车驾驶员在征得乘客同意后，可以在车内吸烟', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '134、出租汽车驾驶员在服务老年乘客时应尽量避免使用紧急制动', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '135、12周岁以下（或1.4米以下）儿室不宜坐在副驾驶位', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '136、出租汽车驾驶员切忌模仿聋哑乘客动作，取笑嘲笑对方', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '137、出租汽车驾驶员应以“乘客至上”为宗旨，满足乘客对语言、用车便利、设施等方面的需求', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '138、出租汽车驾驶员在接待老弱乘客时，要面带笑容、说话温和、使用尊称', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '139、出租汽车驾驶员在接待老弱来客时，要尽量快速行驶，弥补上下车时耽误的时间', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '140、儿童好奇心强，活泼好动，乘车时喜好将头、手伸出窗外，驾驶员遇儿童乘客应当着重提醒并在必要时给予训诫，保证乘车安全', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '141、出租汽车驾驶员不必尊重乘客的宗教信仰和风俗习惯，各取所好', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '142、出租汽车驾驶员在运营过程中不得有抢客、强行揽客、甩客、倒客，未经乘客同意强行拼客等行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '143、出租汽车驾驶员为保降安全可以随时翻包检查乘客携带行李物品', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '144、利用计程计价设备作弊收取车费是出租汽车服务中的违法行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '145、出租汽车经营者应定期开展服务质量评价，并不断改进服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '146、出租汽车驾驶员应保服务质量统计数据和原始记录真实、准确，接受出租汽车行政主管部门的服务质量信誉考核', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '147、对待乘客投诉，出租汽车驾驶员应保持理性、平和的心态', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '148、出租汽车经营者应按规定设置服务监督机构及办公地点，但可以不设服务监督电话', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '149、出租汽车经营者接到乘客投诉后，应当在24h内处理，并及时将处理结果告知乘客', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '150、乘客下车时，出租汽车驾驶员应提醒乘客通过客户端、拨打服务监督电话等形式对其服务评价为优', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '151、出租汽车服务评价指标中，要求乘客投诉处理率和乘客满意率均达到100%.错误\n', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '152、乘客投诉会给出租汽车驾驶员带来麻烦，所以驾驶员可以不配合投诉处理', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '153、乘客对出租汽车服务质量有疑问，可拨打经营者服务监督电话、出租汽车行政主管部门电话等方式进行咨询、投诉', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '154、网络预约出租汽车驾驶员因骚扰、吸毒、超速等方面遭到投诉的，经营者应当暂停该驾驶员提供服务', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '155、出租汽车驾驶员的心理素质是安全行车重要影响因素之一', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '156、行车中做到集中注意力、仔细观察和提前预防是出租汽车驾驶员安全意识的具体表', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '157、出租汽车驾驶员驾驶车辆时保持心情舒畅、平心静气，有助于安全行车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '158、出租汽车驾驶员的个性心理特征对安全行车没有影响', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '159、出租汽车驾驶员克服和控制急躁、愤怒等消极情绪，有助于减少行车中道路交通事故', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '160、心理疲劳是一种常见的心理现象，只要驾驶技术好就可以避免出租汽车运营安全事故的发生', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '161、出租汽车驾驶员小王因营业收入比其他同行收入较低，心理感觉不平衡，在运营中出现争道抢行的行为，其行为可理解', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '162、驾驶员行车中的包容、礼让有助于提高道路运输安全', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '163、出租汽车驾驶员在行车中无论遇到什么情况，当发现自己情绪不稳定时，要进行自我调节和疏导', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '164、出租汽车驾驶员在运营过程中，以最快速度到达目的地比安全文明行车更重要', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '165、出租汽车驾驶员有不良情绪，可以发泄到乘客身上', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '166、主动下车帮乘客搬运行李，有利于缓解长时间保持坐姿带来的疲劳', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '167、出租汽车驾驶员要定期体检，时刻关注自己的身体健康问题，这样既是对自己负责，也是对他人和社会负责', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '168、酒精会麻醉、抑制中枢神经，影响出租汽车驾驶员的判断力，降低视觉敏锐度，使其不能正确有效地控制出租汽车', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '169、出租汽车驾驶员只要其驾驶技术娴熟，吸烟对行车安全影响不大', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '170、镇挣剂、兴奋剂、抗生素、抗过敏药物、治疗胃、肠消化系统和心血管系统的药物，按其临床作用不会对出租汽车驾驶员有影响', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '171、出租汽车驾驶员长时间保持固定姿势容易使腰部疲劳', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '172、音响、空调、计程计价设备、车载卫星定位系统是否正常是出租汽车安全检视的重要内容', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '173、检视发动机、底盘主要看其有无遗洒、泄露', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '174、出车前检视车辆后视镜主要看其是否完好、角度是否调整得当', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '175、出租汽车驾驶员应该对出租汽车做好日常安全检视的工作，如有故障应及时送修，避免在运营途中出现问题，既影响安全又影响运营收入', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '176、驾驶室内空气质量、温度、噪声等环境因素与驾驶员疲劳关系不大', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '177、保证足够的睡眠时间和良好的睡眠质量是预防驾驶员疲劳驾驶的有效措施', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '178、出租汽车驾驶员在服用国家管制的精神药品后，若自我感觉良好，可以驾驶车辆运营', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '179、当行驶到城乡结合部，占道经营的摊点较多，易出现人员拥挤、交通拥堵的情况时，出租汽车驾驶员应小心谨慎、礼让行驶', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '180、行车中遇到车流缓慢或者周边车辆有不文明驾驶行为时，驾驶员应做好自我控制，避免产生急躁、愤怒情绪，影响运营安全', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '181、出租汽车驾驶员只要具备了较高的驾驶技能，就能避免道路交通事故的发生', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '182、夜间行车，驾驶员视距变短，注意力高度集中，易产生疲劳', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '183、雾天驾驶要打开雾灯、远光灯，降低车速，保持较大的跟车距离', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '184、在冰雪道路上行车时，由于积雪对光线的反射，易造成驾驶员目眩', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '185、雪天驾驶出租汽车行驶，轻踩制动或缓打转向时，易导致侧滑、甩尾、转向失控', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '186、高温天气驾驶出租汽车行驶，当感到视线模糊、反应迟钝时要及时停车休息', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '187、雨天行驶，光线昏暗、能见度低，驾驶员视线易受影响，无法清晰观察路况，但只需打开前照灯就能防止上述现象发生', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '188、高温天气行驶，车辆轮胎温度高，行驶中易发生爆胎', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '189、雾天能见度低，看不清前方路况，应进入应急车道行驶相对安全', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '190、驾驶出租汽车通过无人看守的铁路道口，要加速通过', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '191、驾驶出租汽车通过扬尘路段时，要低速慢行，必要时可以开启车灯示意', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '192、驾驶出租汽车遇到窄路、坡道、急转弯处会车时，要低速慢行，必要时停车等待', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '193、出租汽车驾驶员在高速公路行车如遇到前方汽车排队，在乘客要求的前提下可以在紧急停车带上行驶', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '194、雨天驾驶出租汽车要与路边行人保持更大的间距，避免泥水溅污行人', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '195、雾天能见度较低时，驾驶出租汽车应开启雾灯、近光灯、示廓灯，必要时开启危险报警闪光灯', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '196、出现险情时，驾驶员应保持头脑清醒，情绪镇定是做好避险的先决条件', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '197、车速较高时遇到紧急情况，驾驶员应采取急转方向避让，以减小碰撞损坏程度', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '198、驾驶出租汽车行驶中发生爆胎时，应向相反方向急转转向盘或急踩制动踏板', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '199、行车中发动机突然熄火，不能起动时，驾驶员应打开危险报警闪光灯，原地立即停车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '200、车辆高速行驶，遇转向突然失控时，驾驶员应使用紧急制动尽快将车停下，防止事故发生', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '201、车辆发生侧滑时，驾驶员应立即松拾制动踏板，并迅速向侧滑的相反方向转动转向盘，修正方向后继续行驶', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '202、因转向或擦撞引起车辆侧滑时，驾驶员应立即踩踏制动踏板减速，并迅速向侧滑的一方转动转向盘', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '203、车辆行驶中，发现轮胎泄气时，驾驶员应握稳转向盘，缓慢制动减速，停靠在路边安全地点', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '204、车辆因轮胎泄气驶离行车道时，驾驶员不要采用紧急制动，以免造成翻车或造成后车追尾', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '205、车辆因故障必须停车时，在不影响其他车辆行驶的前提下，驾驶员可在行车道缓慢停车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '206、在高速公路上行车，如车辆发生故障需要临时停车时，应将车停至应急车道，并立即在车后方150米外放置警告标志', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '207、驾驶出租汽车遇紧急情况避险时要先考虑人的安全，先人后物', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '208、驾驶出租汽车行驶途中，油路或电路故障容易导致发动机突然熄火', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '209、驾驶出租汽车行驶中，制动突然失效，一次拉紧驻车制动器容易将驻车制动盘“抱死”，损坏传动机件，丧失制动力', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '210、驾驶出租汽车行驶中，制动突然失效，使用驻车制动器辅助制动时，可将操纵杆一次拉紧', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '211、驾驶出租汽车通过弯道时，可以加速超车，提高通行效率', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '212、出租汽车具有单人单车运营、流动、分散运营等特点，驾驶员应充分认识运营治安问题的严峻性，提高防范意识', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '213、出租汽车驾驶员在遇劫后，要注意自我保护，在财产和生命安全面前，应当首先考虑财产安全', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '214、出租汽车驾驶员运营过程中如发现有其他车辆发出求救信号时，应当尽量协助，并迅速拨打救援电话', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '215、出租汽车遇劫时，可使用车载卫星定位系统报警', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '216、出租汽车驾驶员遇到抢劫犯罪，应临危不惧，胆大心细，拼尽全力制服罪犯', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '217、易燃液体一旦起火，应立即用水扑救', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '218、酒精、黄磷、农药都属于危险化学品', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '219、烟花、爆竹、火柴都属于危险化学品中的爆炸品', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '220、方便百姓、优质服务是出租汽车驾驶员社会责任在服务广大群众出行方面的体现', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '221、救死扶伤、提供援助是出租汽车驾驶员的社会责任，因此不能考虑自身安危', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '222、不做有损城市形象的事，不信谣、不传谣是对出租汽车驾驶员承担社会责任的要求', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '223、出租汽车驾驶员义务为高考学生提供接送服务是无私奉献社会的行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '224、出租汽车驾驶员只有做到诚实守信、文明服务，才能赢得乘客认可，提高职业信誉', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '225、出租汽车驾驶员职业道德水平与出租汽车服务质量没有直接关系', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '226、文明服务要求出租汽车驾驶员形象文明、语言文明、态度文明和举止文明等', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '227、拒载、故意绕道行驶等行为违背了出租汽车驾驶员诚信经营的职业道德', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '228、出租汽车行业是典型的服务业，出租汽车驾驶员从业期间应当树立盈利至上的从业意识', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '229、“爱国、敬业、诚信、友善”，是公民基本道德规范，是从个人行为层面对社会主义核心价值观基本理念的凝练', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '230、巡游车和网约车运价均实行政府定价或政府指导价，出租汽车驾驶员必须遵照执行', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '231、巡游车和网约车均应当依法经营、诚实守信、市场定价、优质服务', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '232、巡游车和网约车均应当配置统一的标志顶灯和计程计价设备', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '233、巡游车运价实行政府定价或政府指导价，并依法纳入政府定价目录', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '234、巡游车计程计价设备显示的车费已经包含车辆通行费，不得向乘客另外收取', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '235、出租汽车驾驶员在本区域内运营过程中，可以依据燃油价格等因素与乘客协议确定车费', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '236、出租汽车时距并计是指载客营运时按照行驶时间和里程同时计费的方式', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '237、出租汽车驾驶员应当按照规定使用计程计价设备，执行收费标准并主动出具有效车费票据', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '238、网约车运价一律实行市场调节价', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '239、网约车运价实行政府定价，城市人民政府认为有必要实行政府指导价的除外', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '240、网约车平台公司应当按照规定确定计程计价方式，不得有不正当价格行为', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '241、网约车实行市场调节价，不需要向乘客提供相应的出租汽车发票', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '242、空气滤清器太脏会阻碍空气畅通，从而减少燃油消耗', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '243、当车速过高时，空气阻力明显增大，燃油消耗随着车速的增加而增加', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '244、汽车在运行中，挡位的选择与换挡动作对燃油的消耗都有影响', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '245、行车中，驾驶员感到动力不足时，可猛踩加速踏板，增强动力，防止频繁换挡，这样可以节约燃料', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '246、不必要的加速、减速和停车都将增加废气排放', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '247、较长时间停车时，应将发动机关闭，可以节约燃油消耗，减少汽车废气排放', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '248、在道路上发生交通事故，仅造成轻微财产损失，且基本事实清楚的，当事人应当先撤离现场，再进行协商处理', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '249、饮酒或醉酒驾驶出租汽车造成重大交通事故，构成犯罪的，依法追究刑事责任，驾驶证，终身不得重新获得机动车驾驶证', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '250、道路交通事故适用简易程序处理完毕后，当事人应立即撤离现场，恢复交通', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '251、发生道路交通事故后，肇事车逃逸时，驾驶员要记清肇事车辆的车型、颜色、特征及逃逸方向，以及逃逸驾驶员的体貌特征等', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '252、发生未造成人身伤亡的道路交通事故后，双方协商未达成一致的，出租汽车驾驶员要及时拨打报警电话', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '253、发生道路交通事故，驾驶员应当设法让乘客远离事故现场，选择安全的地方等待，以防发生二次事故', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '254、使用灭火器灭火时，人要站在下风处，灭火器要瞄准火苗', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '255、车辆发动机起火时应迅速关闭发动机，打开发动机罩灭火', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '256、驾驶出租汽车行车中突遇地震时，应组织乘客躲在出租汽车里，不要下车', 'A': '正确', 'B': '错误', 'T': 'B'}, {'题目': '257、出租汽车驾驶员应掌握一定的救护知识，当乘客在车上突发疾病时能采取力所能及的救护，实施抢救', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '258、发生道路交通事故后，向120求助时，应详细说明受伤人员伤情，以便救护人员带齐药品和器械实施有效的救助', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '259、出租汽车驾驶员应当积极参与自然灾害、事故灾难、公共卫生事件和社会安全事件等突发事件的应对工作', 'A': '正确', 'B': '错误', 'T': 'A'}, {'题目': '260、车辆起火后，驾员救火时应张大口呼吸新鲜空气，以免缺氧', 'A': '正确', 'B': '错误', 'T': 'B'}]


data_list=[{'题目': '1. 出租汽车驾驶员从业资格全国公共科目考试成绩在()内有效。', 'A': 'A.省、直辖市域范围', 'B': 'B.市域范围', 'C': 'C.全国范围', 'D': 'D.县市域范围', 'T': 'C'}, {'题目': '2. 出租汽车驾驶员从业资格全国公共科目考试实行()的考试大纲。', 'A': 'A.全国统', 'B': 'B.全省统', 'C': 'C.地市统', 'D': 'D.县内统', 'T': 'A'}, {'题目': '3. 出租汽车驾驶员取得从业资格后,并进行(),方可从事出租汽车客运服务。', 'A': 'A.培训', 'B': 'B.实习', 'C': 'C.注册', 'D': 'D.继续教育', 'T': 'C'}, {'题目': '4. 拟从事出租汽车客运服务的驾驶员,应当向()申请参加出租汽车驾驶员从业资格考试。', 'A': 'A.从业资格培训机构', 'B': 'B设区的市级地方人民政府出租汽车行政主管部门', 'C': 'C.出租汽车行业协会', 'D': 'D大型出租汽车经营企业', 'T': 'B'}, {'题目': '5. 出租汽车驾驶员到从业资格证发证机关核定的范围外从事出租汽车客运服务的,应当()。', 'A': 'A.参加当地的从业资格换证考试', 'B': 'B.参加全国公共科目考试', 'C': 'C.参加当地的区域科目考试', 'D': 'D.重新参加全国公共科目考试和当地的区域科目考试', 'T': 'C'}, {'题目': '6. 受理注册申请的出租汽车行政主管部门应当在()内办理完结注册手续。', 'A': 'A.3日', 'B': 'B.5日', 'C': 'C.10日', 'D': 'D.15日', 'T': 'B'}, {'题目': '7. 巡游出租汽车驾驶员注册有效期届满需继续从事出租汽车客运服务的,应当在有效期届满30日前,向所在地()申请延续注册。\n', 'A': 'A.网信部门', 'B': 'B.公安交管部门', 'C': 'C.出租汽车行政主管部门', 'D': 'D.工商管理部门', 'T': 'C'}, {'题目': '8. 出租汽车驾驶员从业资格注册有效期为()。', 'A': 'A.1年', 'B': 'B.2年', 'C': 'C.3年', 'D': 'D.5年', 'T': 'C'}, {'题目': '9. 申请从业资格注册或者延续注册的出租汽车驾驶员,应当到()申注册。', 'A': 'A.发证机关所在地的出租车行政主管部门', 'B': 'B.发证机关所在地的县级交通运输主管部门', 'C': 'C.发证机关所在地的市级交通运输主管部门', 'D': 'D.发证机关所在地的省级交通运输主管部门', 'T': 'A'}, {'题目': '10. 个体巡游出租车经营者自己驾驶出租汽气车从事经营活动的,持其()申请注册。', 'A': 'A.身份证、机动车驾驶证', 'B': 'B.从业资格证、车辆运营证', 'C': 'C.机动车驾驶证、从业资格证', 'D': 'D.机动车驾驶证、车辆运营证', 'T': 'B'}, {'题目': '11. 出租汽车驾驶员注册有效期届满需继续从事出租汽车客运服务的,应当在有效期届满前()内申请延续注册。\n', 'A': 'A.5日', 'B': 'B.10日', 'C': 'C.20日', 'D': 'D.30日', 'T': 'D'}, {'题目': '12. 巡游出租汽车驾驶员在从业资格注册有效期内,与出租汽车经营者解除劳动合同或者经营合同的,应当在()内向原注册机构报告,并电请注销注册。\n', 'A': 'A.5日', 'B': 'B.10日', 'C': 'C.20日', 'D': 'D.30日', 'T': 'C'}, {'题目': '13. 出租汽车驾驶员取得从业资格证超过3年未申请注册的,注册后上岗前应当完成不少于()学时的继续教育。\n', 'A': 'A.72', 'B': 'B.54', 'C': 'C.27', 'D': 'D.18', 'T': 'C'}]

flag = 0

i=0
j=0

class Read_excel:
    def __init__(self):
        self.data = {}
        # self.df = pd.read_excel('./data.xlsx', sheet_name=0)
        # print(self.df)


    def get(self):


        # global flag
        # if flag == 4:
        #     flag = 0
        # self.df = pd.read_excel('./data.xlsx', sheet_name=flag)
        # index = random.randint(0, len(self.df['题目编号']) - 1)
        # print(self.df.iloc[index])
        # self.data['题目'] = str(flag+1)+". "+str(self.df.iloc[index]['题干'])
        # self.data['A'] = 'A.' + str(self.df.iloc[index]['A'])
        # self.data['B'] = 'B.' + str(self.df.iloc[index]['B'])
        # self.data['T'] = self.df.iloc[index]['正确答案']
        # flag += 1
        # print(self.data)
        global i
        data=data_list[i]
        i+=1
        # print(i)
        return data

    def getpd(self):
        global j
        data=datapd_list[j]
        j+=1
        return data

r = Read_excel()


class basedesk():
    def __init__(self, master):
        self.root = master
        self.root.config()
        # 设置标题
        self.root.title('答题系统')

        # 设置窗口大小
        self.width = 900
        self.height = 600
        # 获取屏幕尺寸以计算布局参数，使窗口居屏幕中央
        self.screenwidth = root.winfo_screenwidth()
        self.screenheight = root.winfo_screenheight()
        alignstr = '%dx%d+%d+%d' % (
        self.width, self.height, (self.screenwidth - self.width) / 2, (self.screenheight - self.height) / 2)
        self.root.geometry(alignstr)
        # 大小不可变，更改为True则可变
        self.root.resizable(width=False, height=False)
        initface(self.root).run()

"""
顺序答题：判断题答题界面
"""
class initface():
    def __init__(self, master):
        self.master = master
        self.master.config(bg='green')
        # 基准界面initface
        self.initface = tk.Frame(self.master, )
        self.initface.pack()
        btn = tk.Button(self.initface, text='跳转到选择题', command=self.change)
        btn.pack()

        self.img = None
        # self.img = tk.PhotoImage(file='./ABCD.png')

        # 获取数据
        self.data = r.getpd()

        self.text_topic = tk.StringVar()
        self.text_topic.set(self.data['题目'])
        self.text_A = tk.StringVar()
        self.text_A.set(self.data['A'])
        self.text_B = tk.StringVar()
        self.text_B.set(self.data['B'])

    def begin(self):
        # print('*' * 50)
        # print('下一题：1111')
        self.data = r.getpd()

        # self.text_topic = tk.StringVar()
        self.text_topic.set(self.data['题目'])
        # self.text_A = tk.StringVar()
        self.text_A.set(self.data['A'])
        # self.text_B = tk.StringVar()
        self.text_B.set(self.data['B'])

        self.canvas.delete(self.hint)
        self.canvas.delete(self.next)

        b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 20), image=self.img, bd=1, width=20,
                       height=50,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_A)
        b1.pack()
        self.cb1 = self.canvas.create_window(200, 350, width=200, height=100, window=b1)

        b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 20), image=self.img, bd=1, width=20,
                       height=50,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_B)
        b2.pack()
        self.cb2 = self.canvas.create_window(700, 350, width=200, height=100, window=b2)

    def run(self):
        self.canvas = tk.Canvas(self.initface, width=1100, height=600, bd=0, highlightthickness=0)
        # imgpath = './ABC.png'
        # img = Image.open(imgpath)
        # photo = ImageTk.PhotoImage(img)
        # 设置窗口大小
        self.width = 900
        self.height = 600

        self.canvas.create_image(self.width/2, self.height/2)
        self.canvas.pack()

        topic = Label(self.initface, textvariable=self.text_topic, font=("华文行楷", 20), wraplength=500, width=500, height=120,
                      anchor="w",
                      justify=tk.CENTER)
        topic.pack()
        self.canvas.create_window(450, 100, width=500, height=120, window=topic)

        # photo2 = tk.PhotoImage(file='./ABCD.png')
        b1 = tk.Button(self.initface, textvariable=self.text_A, font=("宋体", 20), fg='black',bd=1, width=20, height=50,
                       compound="center",wraplength=200,
                       command=self.verify_A)
        b1.pack()
        self.cb1 = self.canvas.create_window(200, 350, width=200, height=100, window=b1)

        b2 = tk.Button(self.initface, textvariable=self.text_B, font=("宋体", 20), fg='black', bd=1, width=20, height=50,
                       compound="center",wraplength=200,
                       command=self.verify_B)
        b2.pack()
        self.cb2 = self.canvas.create_window(700, 350, width=200, height=100, window=b2)
        self.initface.mainloop()
    def verify_create(self):
        self.canvas.delete(self.cb1)
        self.canvas.delete(self.cb2)
        # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
        b3 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                       compound="center",
                       command=self.begin)
        self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b3)

    def verify_A(self):
        # print('你的A')
        if self.data['T'] == 'A':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.canvas.delete(self.cb1)
            self.canvas.delete(self.cb2)
            # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
            b3 = tk.Button(self.initface, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                           compound="center",
                           command=self.begin)
            self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b3)
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def verify_B(self):
        # print('你的B')
        if self.data['T'] == 'B':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为'+self.data[self.data['T']] # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def change(self, ):
        self.initface.destroy()
        face1(self.master).run()

"""
顺序答题 选择题答题界面
"""

class face1():
    def __init__(self, master):
        self.master = master
        self.master.config(bg='blue')
        self.face1 = tk.Frame(self.master, )
        self.face1.pack()
        btn_back = tk.Button(self.face1, text='回到判断题', command=self.back)
        btn_back.pack()

        #add********

        self.img = None
        # 获取数据
        self.data = r.get()

        self.text_topic = tk.StringVar()
        self.text_topic.set(self.data['题目'])
        self.text_A = tk.StringVar()
        self.text_A.set(self.data['A'])
        self.text_B = tk.StringVar()
        self.text_B.set(self.data['B'])
        self.text_C = tk.StringVar()
        self.text_C.set(self.data['C'])
        self.text_D = tk.StringVar()
        self.text_D.set(self.data['D'])

    def begin(self):
        # print('*' * 50)
        # print('下一题：1111')
        self.data = r.get()

        # self.text_topic = tk.StringVar()
        self.text_topic.set(self.data['题目'])
        # self.text_A = tk.StringVar()
        self.text_A.set(self.data['A'])
        # self.text_B = tk.StringVar()
        self.text_B.set(self.data['B'])

        self.text_C.set(self.data['C'])
        self.text_D.set(self.data['D'])

        self.canvas.delete(self.hint)
        self.canvas.delete(self.next)

        b1 = tk.Button(self.face1, textvariable=self.text_A, font=("宋体", 10), image=self.img, bd=1, width=20, height=50,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_A)
        b1.pack()
        self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

        b2 = tk.Button(self.face1, textvariable=self.text_B, font=("宋体",10), image=self.img, bd=1, width=20, height=50,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_B)
        b2.pack()
        self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)

        b3 = tk.Button(self.face1, textvariable=self.text_C, font=("宋体", 10), image=self.img, bd=1, width=15, height=20,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_C)
        b3.pack()
        self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

        b4 = tk.Button(self.face1, textvariable=self.text_D, font=("宋体", 10), image=self.img, bd=1, width=15, height=20,
                       compound="center", wraplength=200, fg='#000',
                       command=self.verify_D)
        b4.pack()
        self.cb4 = self.canvas.create_window(790, 300, width=180, height=100, window=b4)


    def run(self):
        self.canvas = tk.Canvas(self.face1, width=1100, height=600, bd=0, highlightthickness=0)
        # imgpath = './ABC.png'
        # img = Image.open(imgpath)
        # photo = ImageTk.PhotoImage(img)
        # 设置窗口大小
        self.width = 900
        self.height = 600
        self.canvas.create_image(self.width/2, self.height/2)
        self.canvas.pack()

        topic = Label(self.face1, textvariable=self.text_topic, font=("华文行楷", 20), wraplength=500, width=500, height=120,
                      anchor="w",
                      justify=tk.CENTER)
        topic.pack()
        self.canvas.create_window(450, 100, width=500, height=120, window=topic)

        # photo2 = tk.PhotoImage(file='./ABCD.png')
        b1 = tk.Button(self.face1, textvariable=self.text_A, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                       compound="center", wraplength=200,
                       command=self.verify_A)
        b1.pack()
        self.cb1 = self.canvas.create_window(100, 300, width=180, height=100, window=b1)

        b2 = tk.Button(self.face1, textvariable=self.text_B, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                       compound="center", wraplength=200,
                       command=self.verify_B)
        b2.pack()
        self.cb2 = self.canvas.create_window(330, 300, width=180, height=100, window=b2)
        b3 = tk.Button(self.face1, textvariable=self.text_C, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                       compound="center", wraplength=200,
                       command=self.verify_C)
        b3.pack()
        self.cb3 = self.canvas.create_window(560, 300, width=180, height=100, window=b3)

        b4 = tk.Button(self.face1, textvariable=self.text_D, font=("宋体", 10), fg='black', bd=1, width=20, height=50,
                       compound="center", wraplength=200,
                       command=self.verify_D)
        b4.pack()
        self.cb4 = self.canvas.create_window(790, 300, width=180, height=100, window=b4)
        self.face1.mainloop()

    def verify_create(self):
        self.canvas.delete(self.cb1)
        self.canvas.delete(self.cb2)
        self.canvas.delete(self.cb3)
        self.canvas.delete(self.cb4)
        # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
        b5 = tk.Button(self.face1, text='下一题', font=("宋体", 15), bd=2, width=20, height=50,
                       compound="center",
                       command=self.begin)
        self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)

    def verify_A(self):
        # print('你的A')
        if self.data['T'] == 'A':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.canvas.delete(self.cb1)
            self.canvas.delete(self.cb2)
            self.canvas.delete(self.cb3)
            self.canvas.delete(self.cb4)
            # photo3 = tk.PhotoImage(file='./Little Program/Answer Square.gif')
            b5 = tk.Button(self.face1, text='下一题', font=("宋体", 20), bd=2, width=20, height=50,
                           compound="center",
                           command=self.begin)
            self.next = self.canvas.create_window(450, 400, width=200, height=100, window=b5)
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为' + self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def verify_B(self):
        # print('你的B')
        if self.data['T'] == 'B':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为' + self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def verify_C(self):
        # print('你的B')
        if self.data['T'] == 'C':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为' + self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def verify_D(self):
        # print('你的B')
        if self.data['T'] == 'D':
            # print('恭喜你答对了。')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='恭喜你，答对了！'  # 所绘制文字的内容
                                                , fill='green', font=("微软雅黑", 25))
            self.verify_create()
        else:
            # print('打错了')
            self.hint = self.canvas.create_text(435, 230,  # 使用create_text方法在坐标（302，77）处绘制文字
                                                text='你回答错了！正确答案为' + self.data[self.data['T']]  # 所绘制文字的内容
                                                , fill='red', font=("微软雅黑", 25))
            self.verify_create()

    def back(self):
        self.face1.destroy()
        initface(self.master).run()


if __name__ == '__main__':
    root = tk.Tk()
    basedesk(root)
    root.mainloop()